{ "Quest20" : {"Special Features":"Architectural, Historical", "Clue3":"Before Reed Hall was built\nEleazar Wheelock was the one\nWho had the first library\nIn his home it was run.\nA mystery in 1838! This very same home\ndisappeared!  Oh WHERE did it roam?\n","Walking Conditions":"Pavement","Description":"Explores the history of Hanover’s libraries – and mysterious moving buildings!","Clue1":"To get there: This Quest starts in the middle of the Dartmouth College green.  Take 91 to exit 13, travel east across the Connecticut River, and up the hill on West Wheelock.  The green is at the top of the hill on your left.","Clue8":"Turn left and go east straight on your way\nPast a new place to park don't be tempted to stay!\nCrossing beyond to Maloney's right there\nThen cross once again and stop!  We are WHERE?\nYes, in 1975 it happened once again\nall of  those books were moved to a different spot!","Season":"Year Round","Clue6":"Cross West Wheelock.  Go right We're almost there\nAnd the mystery solved about the house that went WHERE?\nKeep going, keep looking, and follow your noses.\nOpen your eyes wide-can you smell the roses?\nGo in (if it is open) four columns you've seen before\nTwo located on either side of the door.\n","Location":"Hanover, NH","Bring":"Compass","Clue4":"Our mystery will be solved later in the day,\nBut first we go off in another way.\nWalk north to an architectural treasure\nWhose stones are too huge to measure.\nBe sure to count the arches all\nBefore you turn to the four-columned hall.\nTwo Dartmouth libraries side by side.\n","Duration":"45","Clue2":"From where you park go to the green.\nMeet in the middle where a clock is seen.\nThen turn to the east.  Walk to a building tall\nIt is on a corner and its name is Reed Hall.\n","Clue9":"To this place, the Howe Library, \nthat we enjoy a whole lot!\nGo down the stairs and around the back, \nlooking for the bicycle rack.\nThen find the back door.  A large push button you'll see.  \nOpen the hinge and you will squeal with glee! \n","Title":"Libraries of Hanover","Clue7":"The inside wall has a plaque, giving some insight you might lack.\nWhile a flower shop now, it used to be a library HOWE!\nNow back to the corner, and stroll south to where awnings abound\nDartmouth, Ledyard, Wheelock are names to be found.\nStop at the ivy-covered building in the middle\nThen go to the second light to soon solve this riddle.\n","Difficulty":"Moderate","Clue5":"One of columns to view with pride \nThe other one with a weather-vane tower\nThat chimes for you at every hour.\nProceed west.  Four brick buildings you will see.\nThen walk south: at the corner an eatery.\n"},"Quest112":{"Special Features":"Historical","Clue3":"From Garipay House follow Route 14 south.\nDon't you feel \"welcomed?\"\nTwo red brick buildings sit side by side.\nA little law office, and in \"1828\"\nGovernor Pingree resided.","Walking Conditions":"Pavement","Description":"","Clue1":"To get there: Take Exit 12 off of I-91 and then travel east to Route 5.  Turn right and take Route 5 south to the bottom of the hill.  Then turn right (west) onto Route 14.  Travel approx. 1 mile to get to Hartford Village.  The Quest begins at the Hartford Historical Society, 1461 Maple Street.","Clue8":"This hotel welcomed strangers to our town.\nNow enter the store and ask the store clerk\nWhere your treasure box can be found.","Season":"May-Oct","Clue6":"Follow the path back to the road called \"Ferry Boat Crossing.\"\nOn the road take a left. (I don't mean to be so bossy.)\nJust before several houses, take the small path heading up to the right.\nClimb diagonally up the hill until the town is back in sight.","Location":"Hartford, VT","Bring":"","Clue4":"Go across the road to a sign that says \"Ferry Boat Crossing.\"\nGo down the hill to a pile of rocks. (Please-no tossing!)\nOnce an old covered bridge ended right here,\nBut due to spring flooding, the iron bridge up above appeared.","Duration":"20","Clue2":"Stand in front of the Hartford Historical Society, and\nYour Quest will begin.\nWhen this house was first built in 1915\nAn undertaker lived within.","Title":"White River Village","Clue7":"Now go carefully across the road to the Elk with the star.\nHead south and cross Park Street to a store for your car.\nOn this spot-right where you standóonce stood the Pease Hotel.\nAn 1889 fire swept through the building making everyone yell!","Difficulty":"Easy","Clue5":"Walk 45 paces upstream, then turn left to the river.\nStroll down to the banks. Don't fall in or you'll shiver!\nLook across to a stone wall where a dam used to be,\nMaking power for many busy factories."},"Quest10":{"Clue5":"Where the trail turns left, a bridge you'll see\nto a field where merino sheep used to be.\n(Pass the bridge, staying on the trail).","Title":"Shaker Village Ceremonial Site","Clue4":"At the fork, bear to the right\nand up a ways a meadow you'll sight.\n","Clue9":"Go a hundred yards heading west.\nYou're almost there-the end of your Quest.","Special Features":"Historical, Natural, Vista","Clue3":"Follow the path that goes along straight\nand it will lead you to a gate.  (Go around).","Clue8":"At the little white post, take a short break\nfor a compass reading you may take.\nHead west at the bearing of 268\n(Hint: due west is 270 degrees).","Season":"May-Oct ","Location":"Enfield, NH","Clue11":"At the southeast corner of this spiritual place\nyou'll find our box's special space.\n","Duration":"45","Walking Conditions":"Trail","Clue2":"Look north toward the hill and you'll see a sign\nthat shows Enfield's Conservation line.","Difficulty":"Moderate","Description":"Hike up to a meadow where the Shakers worshiped.","Clue7":"Across the top of the hill and then you'll see\nan old granite post and a big locust tree.\n7. Up ahead is a house, but how can that be?\u000bIt's too small to live in unless you're a bee\nbut how ëbout a ropetow so people could ski.\n","Clue1":"To get there: Take I-89 south of Lebanon to Exit 17. Take Rte. 4 east to Rte. 4A.  Make a right onto Rte. 4A and drive south 3.3 miles.  Park in the driveway with a sign for Stone Mill on the right (west) after passing the Shaker Museum.","Clue6":"The trail turns west, as up you go\nand a beautiful view of the lake below.\n(Observe bluebird bird houses).\n","Bring":"Compass","Clue10":"March up the hill like a Shaker would\nand come to a grove in the woods.\nYou'll see a gate and a sign.\nIt speaks of a long forgotten time.\n(Take some time and read the sign)."},"Quest93":{"Clue21":"Along the way, go to a white pillar on your right (a memorial) just this one more.\nIn memory to those taken captive by the Indians in 1754.\nNow facing west go down the stone steps you came up.\nThe treasure is where the pine tree leaves the earth.\nShouldn't it be \"one\" instead of \"some\" then?","Clue5":"Keep heading south.  Do you hear the sound of a bell?  \nIs it the church or the brick house next to it that would ring so well?\nIt is the brick house that in 1772 was built as a one- room schoolhouse.  This is the oldest schoolhouse in Charlestown and it held 40 students, the youngest learning their ABC's and the oldest algebra.","Clue17":"Hurry now, let's not be late.\nNow inside bear right at the first fork.  Then left at the second fork onto a dirt roadway to some stone steps.  Go up the steps and walk straight and narrow until adjacent to the second oak tree off to your left.","Title":"Fort 4's Past","Clue12":"At the next crosswalk you will do just that; and come to some grand trees upon a large lawn.  Can you identify these large evergreens?  Let's hope they never have to be sawn.\nSouth you roamed the first part of this quest, now traveling north I think would be best.","Clue4":"Start at the Fire station and head south toward town.\nThe very first house on the left is where you are bound.\nThis is the site of the Johnson's cabin. They were captured by Indians in 1754. \nThey returned to Charlestown after a ransom was paid.\nThe original cabin is hidden underneath the modern exterior.","Clue9":"It had a sign with a beehive and bees on it, just like the Beehive Tavern of Philadelphia.  I'll mention here as a last note, this place is haunted by two ghosts!  (Oh I almost forgot to say, so was the first house along the way.)","Clue19":"The people from the fort have been here a long time but so has something that is living.\nCan you guess what it may be?  Look ahead at the edge of the woods.\nMy goodness it's a huge sycamore tree!  How many times do your arms go around?\n18 feet the diameter was found.  Just imagine how long this tree has been standing here.","Clue14":"Keep traveling north along Main.  Go to place you would visit if your tooth had a pain.\nMoses Willard, an occupant of the fort, built this house.\nLater, two brothers bought it in 1839.\nThey married two sisters and split the house in two, each living in half.","Special Features":"Historical","Clue3":"Please park in back of the fire station, well out of the way.","Clue8":"Travel south yet once again, to the site of what was the Walker Tavern where you were once able to go right in.  This stone house was the home of Mary Walker whom was the great granddaughter of an original grantee of  # 4.  The \"stone cottage\" as it is commonly called, used to be the Walker Tavern. ","Season":"May-Oct ","Location":"Charlestown Village, NH","Clue16":"You will come to a street named after the direction you were just heading.\nNow head north along the street named East, you will come to a cemetery I am betting.\nTurn right through the first gate. ","Clue20":"History we have discovered and trees of many year.\nIt's almost time to find our treasure, which is very near.\nFacing the tree turn right and head down the road.\nBe careful not to step on a toad!","Clue11":"Now look for a brick house as you journey along and I'll tell you of a poltergeist's song.\nThis house underwent re-construction to return it to its original state.  It was then that the owners heard the ghost.  It banged boards together and slammed doors.  When the re-construction was done, the ghosts' noises disappeared.","Duration":"90","Walking Conditions":"Pavement","Difficulty":"Moderate","Clue22":"Insert period\nShould be \"ghost's\"\nOut of curiosity-careful how?  With the construction?  With his hammer?\nInsert \"a\"\nGeorge suggests using the term \"double-stoned slab\" instead, as there is another \"Moses Willard\" stone near the first oak tree.\nDo we need to be PC?","Description":"Find the original site of the Fort as you learn about Charlestown’s rich history.","Clue2":"Upon entering the village, look for the fire station which is the first building on the left.  Enter the driveway only just beyond the station building as this is a one-way driveway. ","Clue7":"The library holds a lot of interesting things, including a carved wooden eagle (seen from the side door) and some of Charles Hoyt's plays (one of only five in existence).","Clue18":"You are looking for the gravestone of Moses and Susannah Willard, who were killed by Indians June 16th of 1756.  Pay your respects to these fort settlers buried here.\nNow look straight ahead, slightly to your left, for a chalice standing high in the sky.\nIt is the Johnson's burial spot, also settlers of the fort.","Bring":"Compass","Clue13":"Onward to a place where you can sleep and eat while resting your very weary feet.\nNow a bed & breakfast this house was built by Phineas Stevens in 1752.  \nHe was very careful while building this house, for Indians captured him as a youth.","Clue1":"To Get There:  From Exit 7 off I-91, travel east on Route 11.  At the intersection of Routes 11 & 12, take Route 12 south towards Charlestown Village.","Clue6":"Continue down the sidewalk quite a ways, until a pizza parlor comes into your gaze.\nYou could stop in to have a bite to eat, but when you're done go back outside and cross the street.  The place you should find yourself to be is in front of the Silsby Public Library. ","Clue15":"Keep going toward a brick building called Dan's, you can buy everything here from cards to pans.  The street next to this is Perry Ave., travel up it if the treasure you want to have.\nOn the side of this building you will see, a mural dedicated to Charlestown's past history.\nContinue to the end of this street.","Clue10":"The next house south that is on your right, is Fort #4's original site!\nAt your back is a stone with a plaque. Go over and read a little Fort history.\nNow travel south to house #304.  Stop here and of history you'll learn more.  Hidden by bushes in the back of this house is a well that is thought to have been used by the fort."},"Quest109":{"Clue5":"Just to compare, walk 14 paces (if you dare)\nAnd to your right will be a maple tree of a different type.\nIts leaf edges are smooth. Its 5 lobes make many Vs.\nBut it is because of the syrup that it makes\nThat we call this one a \"sugar\" maple tree.","Title":"Hurricane Forest","Clue12":"But your Quest turns around and\nYou must now head back downstream\nTo the previous fork where you now take a left\nAnd head across a bridge with your Questing team.","Clue4":"Continue clockwise until you enter the woods.\nStop at 6 gray boulders and then you should\nTurn 180 degrees and find the maple tree\nWhich has split into three.\nNotice its leaves with coarsely toothed lobes.\nWe call it \"Red\" because of its autumn glow.","Clue9":"Notice the direction that all of the trees fell.\nThey were blown to the North-Northwest...\nA sure sign of a hurricane which comes at us\nFrom the South Southeast at its best.","Clue14":"On your right you will find a white pine,\nOne with a very large trunk.\nThis trunk splits into two curly stalks-\nAnd a good place to find a chipmunk.","Special Features":"Natural","Clue3":"Walk clockwise around the pond, and in 60 paces\nYou will see a house in the water of all places.\nA habitat for hobbits? A shelter for lambs?\nNoóa place where water is released from the dam.","Clue8":"The mounds we call pillows and the holes are cradles.\nAnd in this particular site\nSeveral pillows and cradles reveal that trees were blown down,\nTogether by a force of wind of a great height.","Season":"May-Oct ","Location":"White River Junction, VT","Clue16":"Between its trunks you will find your treasure,\nAnd when you've finished there is no need to measure.\nFor the quickest way back to your car\nIs to continue northeast until you hit the tar.","Clue11":"As you proceed and come to a fork a left you'll take.\nFollow a brook upstream to your next stop: A stone wall (no mistake).\nGo 25 paces to a bench made of trees\nAnd rest while you think awhile.\nFrom here you could choose to explore these woods\nAnd hike for many a mile.","Duration":"45","Walking Conditions":"Trail","Clue2":"To begin your Quest go between two fences\nTo a place with a map; here one can be quite pensive.\nThis reservoir was named after Major David Wright.\nFrom here you jus might see a heron take flight.\nThis pond was built to supply water to town.\nThey used no pipes. It just flowed over the ground.","Difficulty":"Easy","Description":"ID trees – while tracking the Hurricane of ’38.","Clue7":"If you look to the ground, mounds you will see.\nThese mark where the roots and trunks of trees used to be.\nAnd behind each mound is a slight hole in the ground.\nThis is the place where roots were before the tree came down.","Clue13":"Admire the white pine stand\nWhile continuing on the footpath.\nNow stop just before the second bridge\nAnd your next clue will require a little math.","Clue1":"To get there: From White River Junction, follow Route 5 south.  Go under 2 highway overpasses. Beyond the second one turn right onto Wright Reservoir Road.  Go 0.5 miles and park at the turnout on your left.  Walk uphill 50 feet to begin your Quest. Note: Please bring a compass.","Clue6":"Continue on the path until you reach the next plateau.\nAnd notice a small ridge to the south as you go.\nWhen that ridge ends you are near your next stop:\nA birch tree on the left with blue on the trunk-not it's top.","Bring":"Field Guide","Clue15":"Cross the bridge now and on your right you will find\nFive rows of log benches no beaver did grind.\nTake a rest on the bench positioned first on the right.\nAh, we have nature's beauty in our sight.\nLook to the south for a two-trunked tree\nThat branches into six (that's 2 times 3).","Clue10":"This wind was fierce, the rain caused flooding.\nChaos and destruction it did create,\nFor this was the storm of all storms in New England-\nThe great \"Hurricane of 1938.\""},"Quest101":{"Club16":"Now you're at the edge of the lake,\nPlease step inside the wooden blind\nLook up, look down, look everywhere-\nAnd see what it is that you can find.","Clue5":"What kind of trees do beavers like to chew?\nUsing your eyes and a field guide to trees\nExamine the stumps that we're sure you'll find.\nThe answer to this question you'll learn with ease!","Club11":"Beech understory, White Pine high above\nProceed towards the observation blinds.\nAs you travel along this wonderful path\nKeep your eyes and ears open for animal signs.","Title":"Exploring Beaver Habitat","Club18":"The Esther Currier Wildlife Management Area at Low Plain is preserved for your enjoyment as a result of community cooperation, including the participation of the Ausbon Sargent Land Preservation Trust, the Elkins Fish & Game Club, the New London Conservation Commission and the NH Fish and Game Department.","Clue4":"Take the first path that you see to the right.\nNow you're looking for clues of the beavers and such.\nKeep walking, eyes open, for chew marks and stumps\nOn your way to the ìOverlookî which you'll like very much.","Clue9":"To continue on your Quest head east to trail\nAnd follow path heading south to water flow.\nWhere the pond is held back is a wall of debris\nBuilt by the inhabitants who homes we now know.\n","Club13":"Two plus four zeros years ago\nGlacier's carved this boggy bowl.\nA glacial ice chunk stayed and melted.\nWe call this place a \"kettle hole.\"","Special Features":"Natural","Clue3":"As you walk straight ahead you will view wonderful treesó\nA garden of pine, hemlock, and birch.\nIt could have been houses on lot after lot\nBut Ester saw better things out on a search.","Clue8":"Fifty-four more steps forward, then spy to the right\n(Two hundred degrees to be most precise!)\nAnother lodge of our friend Castor Canadensis.\nAnd a sign revealing beaver's built here at least twice.","Season":"May-Oct ","Location":"Esther Currier Wildlife Sanctuary, NH","Club10":"Cross the bridge, and follow the shaded path\nPast spruce and fir, hemlock and white pine.\nOn the forest floor, note the cradles and pillows.\nAt \"Davis Path\" turn right towards Observation Blinds.","Club15":" Out of the bog, the trail goes up and down\nAncient glaciers molded these small mounds\nStraight ahead spy yet another beaver lodge\nBut left is where your Quest is bound.","Club17":"Your quest is done, but look for more lodges.\nThere are at least 2-and many species of duck.\nIf you're patient, these all will come into view.\nWhat else can we say but this: Good Luck!","Walking Conditions":"Trail","Duration":"45","Difficulty":"Easy","Description":"This is a fake description.","Clue2":"Esther Currier knew this land well.\nShe envisioned a site of nature and fun.\nOur Quest starts at the gate as you walk down the path\nTo a haven of beauty where animals run.","Clue7":"Head back to the main trail, then onward one hundred steps\nTo beaver's former residence, built of mud and old chew.\nThere, a tree like a chimney rises up high\nTaking in the still water with reflective hues.","Club12":"Immediate left past the number eight.\nDo not - No, do not! - go on to the T.\nTowards Marsh Point your path snakes\nPlease cross on the boardwalk carefully.","Bring":"Field Guide","Club19":"This Department also holds a conservation easement on the property.  Financial support comes from the National Fish & Wildlife Foundation, Ducks Unlimited and numerous private benefactors.","Clue1":"To get there:  Take I-89 to Exit 11.  Take Route 11 east towards New London, NH.  Travel 2.6 miles.  A cemetery will appear on your left and a small parking area on your right.  Turn right into the parking lot for the Esther Currier Wildlife Sanctuary.  ","Clue6":"Look out to the Magical Wetland and see\nReflections of trees, of clouds and of sky.\nStanding dead trunks, called snags, pierce this scene\nA reminder of times when this setting was dry.","Club14":"You're walking on a sphagnum sponge,\nSheep laurel grows on this moist ground.\nLook for tamarack large and small!\nThe only deciduous conifer around!","Club20":"The Esther Currier Quest and the Wellborn Ecology Fund Natural Communities Quest Series as a whole were made possible in part by a generous grant from the Wellborn Ecology Fund of the Upper Valley Community Foundation.  For more information, please visit www.nhcf.org "},"Quest44":{"Clue5":"Take a right and walk until the Dentist sign is in sight.\nWalk down all the stairs, make sure you don't fall, you will see a waterfall.\nHead towards the covered bridge, go up how ever many steps there is.","Title":"Old Quechee Cemetery","Clue4":"Be careful as you walk this little stone wall, because we don't want you to fall.\nUp ahead you'll find a bridge and the water will go over a ridge.\nHey look! It's Simon Pearce glass, go up and around where the cars pass.\n","Clue9":"Clue","Special Features":"Historical","Clue3":"Down the hill, go opposite of right, you must follow a watery site.\nDown where the water flows, that is where you must go.\nFollow the sign that says \"Dam Ahead\", yes you did hear what I said.","Clue8":"Go down 7 steps and you will find people who have gone to rest.\nGo not that long and find a place that says \"Strong\". (These 11 have gone to heaven.)\nFrom \"Evelyn T.\", go diagonal, find two graves that look the same, see?\n","Season":"May-Oct ","Location":"Quechee, VT","Clue11":"Look ahead at \"Porter\" take as many steps as a quarter.\nTurn left to where we just came in, you're almost near the ultimate win.\nGo towards the stairs and past a little star, now you are not very far.\nStand by the star and stand very tall, now go check out the wall.","Duration":"30","Walking Conditions":"Pavement","Clue2":"Start at the Quechee Village Green Gazebo","Difficulty":"Easy","Description":"This village walk ends at a neat old cemetery","Clue7":"You will see a yellow house on the corner, cross the street, you're getting warmer!\nBe careful as you cross the street or you will be dead meat!\nWalk to the stairs, don't forget to get in pairs.","Clue1":"To get there, take I-89 north from White River Junction to Exit 1. Take Rte. 4 west for about 3.2 miles to the blinking light of Quechee Village. Take a right and cross the covered bridge. Go left at the junction. After .2 mile, take a left at the Deli sign and park by the Green.","Clue6":"Go over the bridge, enjoy the view, cross the street, you have to!\nWalk back over this side, we hope you are enjoying this ride.\nGo past the parking lot, look all around, there you will see three trees in the ground.\n","Bring":"","Clue10":"Look straight at the yellow house. Take a left to see the big green tree, \nLet's see how many paces it would be.\nFind the lonely grave hidden under the tree, can you read the name? It's hard to see."},"Quest15":{"Clue21":"In 1892 the building in front of you was called\nThe Grafton Cooperative Cheese Factory.\nDairy farmers brought their milk here and got cheese in return.\nIn 1912, The Cooperative burned down.","Clue5":"At the top of the little hill, take a right\nAnd go until the tubing hill is in sight.\nThe pond below was made by men not long ago\n It is used for wildlife, skating, and making snow.","Clue17":"HINT: The word begins with an \"S\"\nThe name of the town that you see is important too. Use the third letter in the name of the town.","Title":"Grafton Ponds","Clue12":"Keep moving north.  \nYou will see two trees in the middle of a three-pointed fork.\nAs you move down the trail, note the blackberry bushes everywhere.  \nThey are a sign that this place was cleared \nFor sheep farming at one time.","Clue23":"Congratulations! You've finished our quest!  \nWrite all of the letters below in the order that you found them.","Clue4":"Start in the parking lot. Go up the steep slope, \nThis trail was a logging road a long time ago.\nAround 1860, Grafton had three lumber mills\nSo lots of timber was cut down from these hills.","Clue19":"The stones are big and that's how we know\nThe field was used for grazing animals, instead of to grow\nVegetables.  If the stones were small then we would have found\nThat they were probably dug out of the ground.","Clue14":"Keep moving north.\nThere are trails that branch out leading east and west.\nDon't take them.\nNotice that the trail is wider then it used to be. \nThis is because of the invention of a new style of ski.  \nYou'll know you are on the right trail if you see an uprooted tree.\n(Tree is on the right)","Special Features":"Natural, Vista","Clue3":"Welcome to Grafton Ponds! This area was created around fifteen years ago because\nThe Old Tavern at Grafton wanted their guests to have something recreational to do.","Clue8":"There are a lot of animals that live in these woods\nThere are woodchuck, deer, bear, and raccoons.\nAs you move down the trail, look for a trail sign.\nThe sign will be on your right.","Season":"May-Oct ","Location":"Grafton, VT","Clue16":"This property used to be owned by a man named Ed McWilliams. \nThis spot may be where he used to see his sheep grazing peacefully.\nLook in the distance for the two pointy towers.  \nYou will need the fifth letter of the official name of these architectural features.","Clue20":"Look at the beautiful field and take a rest \nHead down the hill, there is not much left. \nFollow the River to the covered bridge.  \nYou need to find out the name of the river below.\nThe first letter of the name of this river is the last clue that you need!","Clue11":"The third and seventh letters are the same and you need to remember this letter.\nContinue past the leaning tree\nWho's two trunks come together in the shape of a V.","Duration":"45","Walking Conditions":"Trail","Difficulty":"Moderate","Clue22":"And for a while there was no cheese in this town.\nIn 1967, this place was rebuilt\nWith the friendly help of Ed Mcwilliams.\nNow, this world-renowned factory of cheese\nHolds your treasure, so go in and buy yourself a Gold treat!","Description":"This Quest along Grafton trails can be walked, biked or skied.","Clue2":"Cross the bridge, turn right after the bridge, and follow the signs to Grafton.  In the heart of Grafton, turn left just before the Tavern, and proceed until you see a sign that says Grafton Ponds.","Clue7":"When you're done at the first stop\nTurn around and go straight up the hill\nNo humans have lived here and this we know\nBecause there is no evidence of old cellar holes","Clue18":"Off to the field and look for a few birdhouses as you go.\nTo get to the field, go down the trail and take a right. \nThere are  stonewalls that surround this field.","Bring":"Binoculars","Clue13":"Some of the trees that you see\nAre used to make a famous Vermont product.\nRemember the first letter of this sweet treat?","Clue24":"If you go into the cheese factory and ask for your treasure box,\nThey will ask you for a password.  The letters that you have written above \nWill spell your password.","Clue1":"To get there: Take route 121 west to Saxons River. Past the post office there will be a fork in the road.  Take a left and keep on going until you get to a little town with a general store.","Clue6":"Look for the small building down by the pond. It was originally set up as a warming hut and picnic site.  Now it is also used to rent skis and sell food. What type of building is this? \nHint:  This type of building ends with an \"N\", \nbut you need to remember the letter, which it begins!","Clue15":"Make sure you stay to the right of the big oak tree.\nThe bark has many deep ridges with flat areas in between. \nTake the NEXT left and move towards the village over look. ","Clue10":"Don't go down that trail, but read the sign for your next clue.\nThe sign says that this trail is used for something specific to do."},"Quest106":{"Clue5":"The competition has eliminated many trees to the point where today-in 2002-there are about 2,000 - 3,000 trees per acre.  But by the time the trees here have matured in 2060 or 2080 only 150 trees per acre will remain.","Clue17":"TO GET BACK TO THE PARKING LOT: Continue up the path. Soon you will arrive at a very large, steep hill. The path becomes narrower. If you walk up the steep path, you will be back at the Ray School.","Title":"Storr's Pond","Clue12":"Pass the snack bar on the left and soon you will come to a small, wooden footbridge.  Walk to the middle of the bridge and you will see a rock-bedded stream; tadpoles and water striders jump about and may be seen. ","Clue4":"Look straight ahead and enter a pine needle-covered forest floor.  Look above and all around you and you shall see a stand of white pine trees. Look a little closer and you may discover black cherry, red maple, yellow birch, poplar, white ash, brown ash, and maybe even a basswood.","Clue9":"This is a drainage canal that controls runoff from the road. In front of you there should be 8 large logs all lined up as seats. You are now at campground \"A\" of Storr's Pond. ","Clue14":"Choose the one not shallow and do not stand still. Follow the narrow footpath that shall lead you eventually back to the great blue walls of the Ray School. Keep an eye out for garter snakes and red squirrels that may dart across your path.","Special Features":"Natural","Clue3":"Continue down the path until you spy a dark, wooden, colonial house.  Go to the maple tree to the left of the house.  From there, face the wire fencing that keeps \"Shamrock.\"  Take a moment to learn of the great deeds he performs.","Clue8":"At this point you should be in a small clearing in the forest.  Seek a small, fern-lined path immediately to your left. Follow a dip and then up a bit until you come to a road in front of you. Come to a stop at a rock-filled ditch. ","Season":"May-Oct ","Location":"Hanover, NH","Clue16":"Here, the path diverges; take the small path to your right. Find a grand hemlock tree swaying so gracefully. If you look carefully under the branches you may discover an informative treasure.\n","Clue11":"Take a right and pause at the swings. Find a seat and swing away. Enjoy the views of maples in front of you. Mosey past the swings and soon you will arrive at Storr's Smores. You can grab a quick snack to quench your Questing hunger!","Duration":"30","Walking Conditions":"Trail","Clue2":"Upon arriving at the Ray School back parking lot by the gym, look straight ahead and take the tree-lined trail cut out from the field.  Look to your left and look to the right, and see Queen Anne's lace and Buttercups bow their heads gracefully in the breeze.","Difficulty":"Easy","Description":"Enjoy Storr’s pond and environs; footpaths, forest and park land.","Clue7":"The path diverges: take a right and you shall see a U-shaped tree with a yellow circular marker.  Follow the path until you reach a massive, mossy, decaying log. Explore it delicately, so as not to disrupt the termites and beetles that make their home in the detritus matter.","Clue18":"Take an immediate right and follow the building until you are returned safe and sound to the parking lot from which you began your Quest.","Clue13":"Walk back across the bridge the way you came and follow the paved path to the left to yet another parking lot. Traverse across the parking area until you reach a basketball court. Past the courts are two trails, one steep and the other shallow.","Bring":"Binoculars","Clue1":"To get there: Travel north on  Route 10 to Reservoir Road.  Turn and travel east on Reservoir Road until you see the Bernice A. Ray School.  Turn left into the school parking lot and park.  The Quest begins by the entrance to the gym.","Clue6":"As you walk through this stand, see if you can find trees that have recently died, as well as trees that have been dead for a long time.\nContinue down the steep hill until you arrive at an intersection.","Clue15":"The footpath widens gradually so that two people may walk side by side. Upon arriving at a clearing in the woods you will spy two birdhouses to your left. If you are lucky you may see a chickadee dining.","Clue10":"Bear right down a paved road. Once you have reached the bottom of the road, there will be tennis courts and a pool to your right. Go to the parking lot nearest to the pond and look to the left and you will see a white billboard standing so lonely. Go and visit this board. Here you shall learn of the pondís water quality."},"Quest9":{"Clue5":"Enfield village is your first destination,\nHiking or biking, get on with exploration!\nHead to the right or, with a compass, go West!\nAll aboard this historical Rail Trail Quest!","Title":"Enfield Rail","Clue12":"The next bridge makes us stop and wonder:\nWho built this so cars take turns going under?\nThe Shakers built the big bridge across the lake\nTo get to the rail depot without effort great.\nDid they tunnel under here and thus this bridge?\nGive a friendly wave to those who way give.","Clue4":" Whistle stops and train rides are long gone,\nVictims of highways and air travel throngs.\nOut of sight are rotting ties and rusty rails,\nNow there is gravel and the Northern Rail Trail.\n","Clue9":"The trail up ahead appears flat and straight,\nBut look to the sides, you are gaining height.\nYou're on top of what's called an embankment \nBuilt for the railroad's advancement.","Clue14":"Upon these walls are etched names and dates,\nBy workers whose sweat this passage did make.\nAt the end of the pass on the left is a rock,\nBehind \"1853\" you will find the Quest box!","Special Features":"Natural","Clue3":"In eighteen hundred and forty seven,\nEnfield folk thought they'd gone to heaven.\nTo this depot they and their cargo could now roll\nTo ride the brand new Northern Railroad.","Clue8":"On the left is Mascoma Lake, long and deep,\nNamed after an ancient Squakheag Indian Chief.\nHis village was in Mass., far away in those days,\nBut his tribe hunted this far North, anyway.\n","Season":"May-Oct ","Location":"Enfield, NH","Clue11":"To the right of this bank, is a rich habitat,\nA wetland home for many a duck, in fact.\nExplore a little and you may see\nA frog, a turtle, a heron...lucky thee!\n","Duration":"30","Walking Conditions":"Trail","Clue2":"Take the first left onto Depot Street. Park at the end of Depot St. in the parking lot to the left of the red building. This building is the old Enfield railroad depot, but now houses the town ambulances. Please make sure not to block the emergency vehicles in any way.\n","Difficulty":"Easy","Description":"Walking through space to mars, you will see stars and martians. There is no comparing the greenness of the aliens, and their work on mars creates an awesome place to explore. Have fun going back in time and changing the past, or seeing the ultimite end of human life from a distance. It's all fun and games when it comes to the this marian trip. This is a fake description","Clue7":"Next stop is the bridge over Mascoma River,\nThe bridge or the rapids might make you quiver.\nInstead think back to how water helped fill a hole\nLeft behind by a glacier, before humans strolled.","Clue13":"The Quest is over, when rock walls appear.\n\"Ledges Pass\" they are called, the end is near.\nTwo gangs of workers, forty men, they say,\nTook a year to carve this cut, with nary a stay.\nGas or steam engines were not yet the rule,\nHand drills and explosives their only tools.","Clue1":"To get there: Take I-89 to Exit 17. Take Rte. 4 east 4 miles to Enfield. Take the second right past the Enfield Garage (High St.) just as Rte. 4 makes a sharp left into town. At the first stop sign, go straight through the intersection.","Clue6":"Before the railroad came, this area, it is said,\nWas mostly farms and a few homesteads.\nThe train was a magnet for prosperity,\nThus the shops, mills and village that you see.","Bring":"Binoculars","Clue15":"Questers please note: At the far end of the pass, there is a trail that leads to the shore of the lake. Once you are on the trail, you are on the private property of Mr. Earl Farnham. Please respect his beautiful property, and be aware that you are passing at your own risk. ","Clue10":"This area was once marsh, soggy and wet,\nWith no place to run a train through...yet.\nRail workers piled dirt high across this wet spot,\nUntil it was set and their backs were in knots."},"Quest97":{"Clue12":"The sign at the top of the hill has a digit that stands\nFir the same number of fingers you have on one hand.\nThe downed white birch marks the last hilltop tale.\nLook closer! It's covered with lots of turkey tails.","Clue25":"Backtrack to the large flat rock; a perfect place to rest and roost\nScan the woods to your left, until you see a web of roots.\nBreak trail to this mysterious place\nWalk gently and look down; you may find an orange newt's face","Walking Conditions":"Trail","Clue11":"As you approach the stone steps, look to the right.\nI used to be a tall tree-now I'm shortened in height.\nInsects and fungus eat me for food.\nThey need me for nourishment when in the mood.\nNearby the steps find another tree.\nWith this one what is the mystery?\nIt's roots are eroded and show off like bones.\nThese make ideal spots for chipmunk homes.","Clue24":"Walk to the mowed grass and feel the sun shining on your face\nAn open space where children love to race\nSurvey the land where mouse eats seeds and fox eats mouse\nUp and down the food chain sun and water matter most.","Clue10":"Here at the \"Y\" head up the hill.\nKeep following the trail and observe as you will.\nYou'll see holes in trees that are called cavities\nAnd fungus growing, too, on the trees that are diseased.","Clue9":"Along the path twin pines mark your way.\nYou wish you could linger there all day.\nTake 22 steps to the start of a high mushroom trail.\nLook to your left for the path, you can't fail.","Clue23":"Continue to the wild field past goldenrod and milkweed\nRefurbished every year by many dispersed seeds.\nAlive with busy insects on a hot summer day\nDragonflies, wasps and crickets go along their way.","Special Features":"Natural","Bring":"Binoculars","Clue7":"Here the land is low and flat.\nPine needles make a lovely mat.\nThe hemlock forest is there if you seek.\nAll it takes is just a little peek.","Clue22":"Pass two logs with hollow centers\nHome to a mole escaping hunting owl dangers?\nDaddy mole, watch out!\nYou better protect your little mole sprout.","Clue5":"Up to the double trees (pine and oak) you should go\nBut not into the water with your toe!\nA snapping turtle lives there all year long,\nThis C.R.E.A. land is where he belongs.","Clue21":"Ahead a \"cradle and pillow\" upon the ground to rest your head\nOr for a tiny chipmunk it could make a cozy bed.\nThis tiny hill grew in the spot where a giant oak once grew\nThe roots ripped up, made a hole and earth filled in anew.","Clue3":"With the Town Hall just behind,\nA large boulder your eyes will find.\nCross the road towards the sign that reads\n\"Rodney Palmer Environmental Study Area\" amidst the weeds.","Clue19":"Walk by aging birch trees sprouting hoof-like fungus\nAlso known as birch polypore mushroom to us.\nMushrooms and fungus are decomposers,\nSo are worms and microscopic creatures.","Clue20":"Beyond the birches only a stone wall remains of the farm from days gone by\nUpon this spot a Cornish Farmer's field used to lie\nAnd in New England if the farmer doesn't mow\nThe life cycles will change and a forest will grow.","Season":"May-Oct ","Location":"Cornish, NH","Clue18":"Stay on the path; don't cross the bridge\nNo time to get lost on the ridge!\nSafety first on Quests or hikes\nDon't play on beaver ponds in winter or you might fall through thin ice!","Duration":"30","Clue1":"To get there:  From Route 12A in Cornish, just south of the Cornish-Windsor Covered Bridge, head east on Town House Road. You will pass the Dingleton Covered Bridge and the Blacksmith Covered Bridge, both on your right. ","Clue17":"From the path see a bridge under which the beaver swim.\nBut don't jump in!\nLook left and see stumps with pointed and chewed tips\nFeasted on by beaver teeth and graced by beaver lips.","Clue16":"Walk a while to the \"seat stump\" where you can lunch.\nNearby are musclewood trees the beavers love to munch.\nAll along the right is a soggy wetland\nBorn from the stream and the beaver's teeth and hands.","Title":"The CREA Natural Communities Quest","Description":"Walking through space to mars, you will see stars and martians. There is no comparing the greenness of the aliens, and their work on mars creates an awesome place to explore. Have fun going back in time and changing the past, or seeing the ultimite end of human life from a distance. It's all fun and games when it comes to the this marian trip. This is a fake description","Clue8":"All of these trees have many uses\nBut the maple is the one with the edible juices.\nThe others are great for building and timber\nAnd white birch paper makes good tinder.","Clue15":"You'll find a baby hemlock in the middle of 3 big trees.\nMaybe someday it will grow to be as tall as these.\nNow look for the place where dirt makes a small mound.\nTo hear chickadees and blue jays, make not a sound.","Clue6":"Two pink worm-like wrigglers on its tongue\nLure its prey in where it's no fun!\nOn your left, red oak, white pine, and white birch you'll see.\nThe white birch is the New Hampshire state tree.","Clue14":"Find five needles per bunch on a nearby white pine.\nHanging on a limb, a rope you will find.\nGo next to a rotten balance beam held up by two trees.\nThis is a good spot for squirrels to eat seeds.","Clue4":"To the right of the sign, a trail you will see.\nTake 50ish steps to a leaning oak tree.\nThe tree has been growing since it was small,\nThis tree likes swamps, but it might fall.\n\nBe very quiet and animals you might spy,\nRabbit, snake, wood frog, chickadee and butterfly.\nHere flies the monarch of orange and black,\nBirds avoid this poisonous snack!","Clue27":"Keep on hunting, your eyes wide and round.\nWhere trunk meets ground the box will be found.\nSign into our box, then re-hide it once more\nYou've learned of this place, now it's time to explore!\n\nfor the confusing new word?\nAdd period stealthfully","Clue13":"Turn yourself around and go back down\nTo where there was a fork on the ground.\nNow walk left to rock past mushroom hill.\nSee the snapping turtle? Perhaps you will.\n\nLook for three stumps cut by beavers with ease.\nRight next to two trees that might be home to some bees.","Clue2":"Just beyond Parsonage Road, you will see the Cornish Fair Grounds on your left, along with the Old Town Hall and Schoolhouse #9. Park by the Old Town Hall. Your Quest begins at the trail head across the street. If you reach the new Elementary School you've gone a bit too far.","Clue26":"Creep stealthful as a fox\nYou've almost found the Quest box!\nWhen you reach the root-statue explore all the nooks\nThen follow the trunk-it points to where you should look.","Difficulty":"Easy"},"Quest14":{"Clue5":"Look up high, there's a long needled pine branch.\nTake a turn to the left, while you do a dance.\nThis is the path to follow to find the treasure.\n","Title":"Palisades Quest\nFairlee, VT\n\nTo get there: Take I-89 to Exit 15. Go west off the exit ramp, and take a right onto Lake Morey Road East.  Park in the Parking lot of the fire station on the corner on your right.\n\nNote: This Quest is near a falcon's nesting site. Peregrine falcons are an endangered species and this is a protected area during the nesting season. Don't go beyond the Quest box.","Clue12":"Out of the woods to a clearing,\nDon't touch too high, or you'll fry.\nStand under the wire.  Go to front support cable.\nTurn to left and walk four steps.\nTurn to view, walk twelve steps to the rock pile.\nDig around and you will come upon our treasure box.\nLook inside; it's stamping time.","Clue4":"Along the off ramp, look on a tree,\nA Lake Morey marker is what you will see.\n","Clue9":"Horray, horray, you're on your way!\nZig, zag, zig, zag for this part of the day.","Special Features":"Natural","Clue3":"Park the car in the lot. Don't stop to rest.\nFollow the fence, there is no bench.\nWalks towards the highway,\nU-turn, and look ahead for the pathway.\n","Clue8":"Take a break, to see our lake. It's on your left.\nAfter a few steps, stop! We don't want you to drop.\n","Season":"May-Oct ","Location":"Fairlee, VT","Clue11":"On your feet, slow and sweet.\nWalk across the bridge you meet.","Duration":"30","Walking Conditions":"Trail","Clue2":"Note: This Quest is near a falcon's nesting site. Peregrine falcons are an endangered species and this is a protected area during the nesting season. Don't go beyond the Quest box.","Difficulty":"Easy","Description":"Walking through space to mars, you will see stars and martians. There is no comparing the greenness of the aliens, and their work on mars creates an awesome place to explore. Have fun going back in time and changing the past, or seeing the ultimite end of human life from a distance. It's all fun and games when it comes to the this marian trip. This is a fake description","Clue7":"Follow the fence; it's on your left.\nThe path is steep, so do not weep.\nThrough the break, don't let the barbed wire bite.\nNow look, it's on your right.\n","Clue1":"To get there: Take I-89 to Exit 15. Go west off the exit ramp, and take a right onto Lake Morey Road East.  Park in the Parking lot of the fire station on the corner on your right.","Clue6":"Caution, when you climb this mountain.\nBe careful you do not disturb the falcon's here.\nThey are a protected species and are nesting near.\n","Bring":"Binoculars","Clue10":"At this egg, we named her Meg.\nNo need to whine, it's time to dine.\nSorry no diner, this place is finer.\n"},"Quest8":{"Special Features":"Natural","Description":"Walking through space to mars, you will see stars and martians. There is no comparing the greenness of the aliens, and their work on mars creates an awesome place to explore. Have fun going back in time and changing the past, or seeing the ultimite end of human life from a distance. It's all fun and games when it comes to the this marian trip. This is a fake description","Walking Conditions":"Trail","Clue3":"A lot of our streets\nwere named after the people.\nNear it was a church\nbuilt with a white steeple.","Clue1":"To get there: Take Exit 13 off I-89 and follow Route 10 south through Grantham until you reach Croydon village.  Continue south on 10 to the fire station. Turn right onto Loverin Hill Rd.  Go to the end of Loverin Hill Rd. The cemetery is past the pond on the right.","Clue8":"Take time to read the stones.\nThe earliest person born in 1813.\nThe youngest child died\nage 3 weeks; too young it seems.\n","Season":"May-Oct ","Clue10":"Enter the cemetery \nfrom the front gate.\nGo straight down the path.\nCheck each stone and each date.","Clue6":"The Foggs family's buried there.\nIt's the only rock of its kind.\nNo other rock like this\nin the cemetery you'll find!","Location":"Croydon, NH","Bring":"Binoculars","Clue4":"The church is now gone\nbut the cemetery remains.\nThere are quite a few families\nwith unusual first and last names.","Duration":"30","Clue2":"Cemeteries are spooky,\nfilled with the dead.\nBut believe it or not-\nit's history fills our head.","Clue9":"There were families with many kids.\nHusbands had lots of wives.\nThey died very early.\nThey lived quite short lives.","Title":"Four Corners Cemetery Quest","Difficulty":"Easy","Clue7":"Look on the other side\nand over the wall.\nYour treasure is there.\nStamp your passbook, don't stall!","Clue5":"Pass the first two rows\nand then take a right.\nContinue down to the end,\na rock with \"Fogg\" will come into sight."},"Quest103":{"Clue5":"For fifty-four miles from Granville to Hartford\nThe White River flows down through villages, and past yards.\nA river is always headed down-from high to low-\nChanneling what falls from the heavens, the rain and melted snow.","Clue17":"Sharon, and Pomfret, and finally at Hartford\nThe White pours into the Connecticut, which takes its waters seaward.\nPeek under the structure that lets you walk above this brook\nFind your treasure on the side nearest to you, go on now, give a look!","Title":"White River Headwaters Quest","Clue12":"Onward past yellow birches and blazes painted blue\nLetting the echo of rushing water pass through you.\nInsects, too, choose to call these waters home\nCaddisfly larvae you can find under many a stone.","Clue4":"From the mighty Mississippi to our wonderful White\nthe headwaters is where rivers begin their magical flight.\nFollow my clues and they will lead the way\nAlong Clark Brook Trail on this beautiful day!","Clue9":"Four boards move you across another small seep\nStraight ahead up the trail we'll continue to creep.\nNow through a tunnel of young spruce we go\nHere you might wish to walk softly, very slow","Clue19":"  Red Spruce\t\t\t\t  Balsam Fir\n  Mink\t\t\t\t\t\t  Fisher\n  Coyote\t\t\t\t\t  Moose\n  White-tailed Deer\t\t\t\t  Least Weasel  \n  Black Bear\t\t\t\t  Red Squirrel\n  Bobcat\t\t\t\t\t  Yellow Birch\n  Caddisfly Larvae\t\t\t\t  Mayfly Larvae\n  Water Striders\t\t\t\t  Dobsonfly Larvae\n  Brook Trout\t\t\t\t  Dace\n  Chipmunk\t\t\t\t\t  Porcupine\n  Hermit Thrush\t\t\t\t  Rose-breasted Grosbeak\n  ___________\t\t\t\t  ___________","Clue14":"Pass an old yellow birch like a twisting elbow\nAnd then a yellow birch on stilts in 25 steps or so.\nA water bar below helps keeps erosion in check\nNow cross over Clark on a wooden plank deck","Special Features":"Historical","Clue3":"you will find a pull off parking area across from the Clark Brook Trail head. Your Quest begins here. Bring bug spray, water, and sturdy walking shoes.  \n","Clue8":"At your feet an intermittent brook will soon pass below, from left to right\nPointing the way to a primitive Forest Service campsite.\nYoung spruces and fir reach up from forest floor\nThe canopy is filled with red spruces galore","Season":"May-Oct","Location":"White River Junction, VT","Clue16":"From here the waters flow-they flow down and down\nPassing through so many central Vermont hill towns.\nFrom Granville to Hancock, then Rochester, Pittsfield\nOnward to Stockbridge, Bethel, and Royaltonís green fields","Clue20":"The White River Headwaters Quest and the Wellborn Ecology Fund Natural Communities Quest Series as a whole were made possible by a generous grant from the Wellborn Ecology Fund of the Upper Valley Community Foundation. For more information, visit www.nhcf.org ","Clue11":"Weasels, black bear, red squirrel and bobcat-\nWe can tell this by finding signs, tracks and scat.\nBrook trout and dace as well love this stream-\nThey choose their water fast, cool, and clean.","Duration":"20","Walking Conditions":"Pavement","Difficulty":"Easy","Clue2":"Just past the Granville Bowl Mill, go left up the dirt Green Mountain Forest Access Road 55. Follow 55 for  1.7 miles to just beyond 2 cabins","Description":"","Clue7":"Soon you will come across a \"welcoming\" sign\nPut your name in the book, go on and take your time.\nYou are asked to \"Pack it In, and Pack it Out\"\nKeeping the forest clean is what that's all about.","Clue18":"When you are all finished, the treasure box you should rehide,\nAnd always remember this river...flowing through so many lives.\n\nWhite River Headwaters Quest Species Check List\n\nWhat did YOU see?\n","Clue13":"You'll also see water striders, stone and may fly\nYou'll see many strange things...if only you try!\nNational Forest land encases this brook on both sides\nGiving many creatures a safe a safe haven to reside.","Bring":"","Clue1":"To get there: Take I-89 to the Bethel exit. Follow Route 107 west to Route 100 north. Make a sharp right turn onto Route 100 north and follow it all the way to Granville.","Clue6":"Our great White River begins with several small brooks.\nClark is the one at which this Quest will closely look.\nOn your left, pass the brown sign and the big gray stone\nHead straight into the forest, a place many birds and animals call home.","Clue15":"Over two rocks and yet another small seep.\nNow on the right bank the Quest treasure we seek\nMt Wilson, Mt Roosevelt, and Little Hans Peak\nAre the boundaries for the watershed of this creek","Clue10":"Down to the right spot a small floodplain\nWhere the water spreads out after a heavy rain.\nMink, fisher, fox, coyote, moose and deer...\nAll of those wild things come to drink here. "},"Quest19":{"Special Features":"Historical","Clue3":"Follow this path to the trail on the right.\nJust be careful, and please don't fight.\nUp the hill, follow blazes of white and blue\nBut be sure not to miss the arrows too.","Walking Conditions":"Pavement","Description":"","Clue1":"To get there: From Hanover, take Rte. 10 north. Turn right on Reservoir Rd.  Go about 1\/2 mile and park in the parking lot for the Ray School on the left.","Season":"May-Oct","Location":"Hanover, NH","Bring":"","Clue4":"Continue on to almost the top\nFor it is there that you will need to stop.\nSo pause and look at the great grandfather trees\nbecause your treasure is hidden in one of these.","Duration":"20","Clue2":"Along Reservoir Road, east you will go\nTo a bike path that doesn't quite show\nUnless you look for mailbox #29\nThen to the left of the driveway, the path you will find.","Title":"Balch Hill Quest","Difficulty":"Easy","Clue5":"After finding the treasure, continue on to the top.\nThere's a beautiful view that will cause you to stop.\nNearby, too, is an amazing oak,\n17 feet around-this isn't a joke.\nSee Mt. Ascutney from the top, Baker Tower too.\nAnd on your way down follow blazes of blue."},"Quest7":{"Clue5":"The hike is beautiful\nwith flowers from the wild.\nThey blossom and bloom\nwhen the weather is mild.","Title":"Croydon's Past Quest","Clue4":"To the right of the dumpster\nyou'll find Forehand Road\nmade of mostly dirt and \nmaybe a toad.","Clue9":"The next dig is where you'll find the treasure\nFrom this one you'll get a lot of pleasure!\nJust a little bit further past a trailer up the road.\nThe treasure dig's up there where the grass is not mowed.","Special Features":"Historical","Clue3":"This quest, you'll see,\nbegins at school\nWhere we have learned\nthe golden rule.","Clue8":"The first grader's dig\nis at the fifth intersection.\nLook, once you find it\nyou'll be bit by the infection.\n","Season":"Full Season","Location":"Croydon, NH","Clue11":"This is the best foundation; it's in good condition.\nLooking for our treasure is an easy mission.\nLook on your map, you'll see s, h, and k.\nThere's our treasureóthe rest we took away!","Duration":"-30","Walking Conditions":"Driving","Clue2":"All of our Quests deal with \nCroydon's past\nIn a century where things\nhappened so fast.","Difficulty":"Super Hard","Description":"We gonna go back in time","Clue7":"Go past a left with a sign\nPatriot's Drive.\nSome summer people live there.\nThey are still alive!","Clue1":"To get there: Take Exit 13 off I-89 and follow Route 10 south through Grantham until you reach Croydon village.  The Quest begins at the schoolhouse, on your right, surrounded by a white picket fence, and on your right.","Clue6":"You'll hike by four turn offs\nthat are on your right.\nDon't get too lost;\nthere's a possibility you might.","Bring":"A flux capacitor","Clue10":"It's on the left side so keep your eyes open.\nNo time to be discouraged; and no time for moping.\nLook for two big trees. Across the road is a stonewall.\nMoving those big stones was not a ball!"},"Quest23":{"Special Features":"Natural","Description":"Walking through space to mars, you will see stars and martians. There is no comparing the greenness of the aliens, and their work on mars creates an awesome place to explore. Have fun going back in time and changing the past, or seeing the ultimite end of human life from a distance. It's all fun and games when it comes to the this marian trip. This is a fake description","Walking Conditions":"Trail","Clue3":"Behind the gas station, you may park.\nHead east by foot, and look for the mark.\nOn the far side of the field, look to the right.\nWhere the forest starts are blazes of white.","Clue1":"From Exit 13 off I-91 travel east across the Connecticut River into Hanover.  Continue straight through the traffic lights to the second set of lights. Turn right onto South Park Street\/Rte. 120 and continue to the first major intersection. At the intersection, turn left into the parking lot for the Co-op Service Center. ","Clue8":"After a short rest, to the right you may wish to go,\nA few hundred paces to a place you should know.\nNow, here on the right, the trees open for you...\nA view of Etna, with mountains green and sky so blue.","Season":"May-Oct ","Clue10":"You will once again pass the velvety rock,\nPass the forest, the field, to a parking lot.\nWe hope you hike this on a beautiful day:\nAnd, that you find peace and rest-\nAnd a chance to play!","Clue6":"If you look to the middle of this welcoming space,\nA campfire site, you will also face.\nA wood shelter for hikers will be there, too.\nAnd, a rock outcrop boasts a beautiful view.","Location":"Hanover, NH","Bring":"Binoculars","Clue4":"For maybe a mile follow white blazes \nOver rocks and roots.\nYou might be glad if you're in hiking boots.","Duration":"30","Clue2":"As you are driving on Lebanon St.,\nA 5-way stoplight soon you'll greet,\nTo the east, a grocery store, gas station, and field\nBeyond, a forested hill will, our treasure, yield.","Clue9":"From here, the blue blazes go vertically down.\nGo right at the AT sign you've found.\nFollow these blazes onto the right.\nWhen you pick up the old trailñwhat a welcoming sight!","Title":"Velvet Rocks Quest","Difficulty":"Easy","Clue7":"From here, all of Hanover used to be seen,\nNow it is blocked by the trees so beautifully green,\nBut, the sky so blue, you will also see.\nAmong the rocks here, your treasure will be.","Clue5":"When it seems like you've reached a high ridge top,\nKeep looking for a blue blaze where you should stop.\nFollow these spaced out blue blazes \nTo another hill top and see\nA hole in the middle of a very old tree."},"Quest108":{"Clue5":"While imagining the beat of their marching feet\nTurn your body to look across the street.\nNote the tall trees, so scary and old\nThey are locust trees we are told.","Clue17":"Pay final respects to son of Stephen and Abigail\nAnd continue along this historic trail.\nWith your back to Josiah, put your right hand out\nLook for a dull arrow, then give a shout!","Title":"Center of Town Valley Quest","Clue12":"Reverse directions and head down the hill\nTo the sign of red that makes you stand still.\nHead to the right and look for the stump of a tree\nFurther down hill and 2 mailboxes you'll see.\nWith your back to the boxes go back 20 paces.\nGaze at the school house where once kids held races.","Clue4":"Now gaze across the green \nAnd imagine this scene: \nFolks coming down from the hills\nTo practice their drills,\nIn preparation for fights \nTo free up our rights.","Clue9":"Stop and read the sign of white. \nThe bush by the back porch is your next site.\nLeavitt's Inn opened in January of 1794.\nOriginal stenciling is hidden behind the front door.\nThis once was the place for the stagecoach drop.\nBetween Boston and Montreal, people would stop.","Clue19":"So exit if you would this yard of bone\nTake a last look around and keep a low tone. \nThe final moment is here at last. \nIt is the end of our story from Hartford's past. \n\nThe treasure is hidden on the ground\nIf you find a green chimney, then it will be found.","Clue14":"Walk back to the tree and look for a pipe. \nIt is green and an ìout of the groundî type. \nSearch for a white cross and go stand below\nFor this old cemetery we would like to show.","Special Features":"Natural","Clue3":"King George the 3rd was no nerd\nOn July 5th, 1761 he gave us his word \nBy signing the charter to declare this town Hartford.","Clue8":"With your face to the trees and downhill to your right  \nDon't go down or you will be a sorry sight.\nTurn to the left and proceed 70 paces. \nStop at the fork and turn your faces. \nLook for three trees together and stop at number two. \nCross the street to find the next clue. ","Season":"May-Oct ","Location":"White River Junction, VT","Clue16":"Welcome friends, meet the Tildens. \nJosiah ran a tavern out of his own buildings.\nAlso an authority on the weather forecast\nHe fought in the Revolutionary War gone past.","Clue11":"The rocks in this wall were an old foundation. \nFrom a church which once held the Hartford Congregation.\nNow turn your eyes towards the back corner of this space\nWhere old town buildings once stood with grace.","Duration":"30","Walking Conditions":"Trail","Difficulty":"Easy","Clue2":"Many years ago, upon this green\nHartford's Center of Town was a bustling scene.\nSo park your car and come on down\nLet's explore this old ghost town.\nStart at something red, white, and blue\nAnd about old Hartford we will tell you.","Description":"Walking through space to mars, you will see stars and martians. There is no comparing the greenness of the aliens, and their work on mars creates an awesome place to explore. Have fun going back in time and changing the past, or seeing the ultimite end of human life from a distance. It's all fun and games when it comes to the this marian trip. This is a fake description","Clue7":"You should soon stumble upon an old road\nNow look carefully for a tree with marks of old.\nFind this poplar and come to a halt. \nThis old road once led to the graveyard vault.","Clue18":"There lies Solomon Strong with his two wives\nAnd his many children who lost their lives.\nThis family we know has many roots here, \nFarmers, soldiers, and millers-they were all held dear. ","Clue13":"Josephine Orizzonto once taught at this school.\nIn 1943 she ended her rule.\nEnvision all the history we're telling\nAs you look upon this private dwelling.","Bring":"Binoculars","Clue1":"To Get There:  Take Route 4 west two miles from White River Junction. Turn south onto Center of Town Road and proceed to the top of the hill (about 0.8 miles).  Park along the green that is on your right. Your Quest begins here.","Clue6":"Now turn twice and walk to the sign. \nStop to read it, line by line.\nAt the back of the sign let's face the woods\nLook toward the left please if you could.\nTake 35 steps between the biggest tree \nAnd all the picnic tables that you see.","Clue15":"Enter quietly and look for stones in a line\nThree tall light ones and four small dark kind.\nWith your back to the gate\nGo check out their fate.","Clue10":"With your back to the porch walk past four trees. \nWhen you reach the rock, stop if you please.\nLook both ways before you cross. \nMake a right so you don't get lost.\nKeep walking to the end of the old stone wall.\nStand here a minute and reflect on it all."},"Quest116":{"Clue5":"3. \tFrom the gazebo you must rotate,\nHere's what you really need to locate.\nA granite bench, if you found the clue,\nWill have Mr. Colony right in front of you.","Title":"Ashuelot River Park Quest","Clue12":"Look right to where the path curves down,\nYou will hear a rushing sound.\nWhen you listen to the beat,\nYou will want to have a seat.","Clue4":"2.\tGo northwest now from the arch,\nHop or swing or slide or march.\nFind a covered place where you can stop,\nWith your friends under a round rooftop.","Clue9":"Now take the path that's on your right,\nGo and look for a beautiful sight.\nKeep your eyes along the river's edge,\nYou'll see a half moon marsh we certainly pledge.","Clue14":"Go back across the bridge again,\nYou'll ask, \"We'll find the treasure...but when?\"\nWrite the year the bridge was laid \t       __ __ __ __ \nYou're almost there, you've got it made.       C      D","Special Features":"Natural","Clue3":"As you do this Quest today,\nLook out for clues along the way.\nThey are the key to the treasure's lock,\nMake sure to write them in all the right spots.","Clue8":"Cross the bridge to see some boulders,\nDon't look back or over your shoulders.\nYou'll see a house just above your head,\nBut, don't stay here, you must leave instead.","Season":"May-Oct ","Location":"Ashuelot, NH","Clue16":"Fill in the numbers from A, B, C , and D,\nThe lock's combinations you'll certainly see.   __  __  __  __ \n\t\t\t\t\t\t                       A   B   C   D","Clue11":"Continue left on down the path,\nHope you're ready to do some math.\nMeasure yourself against the posts,\nYou'll have to be 3 feet at least, not most.","Duration":"30","Walking Conditions":"Trail","Clue2":"Go through three more lights. At the third light turn right and you will be in the Ashuelot River Park parking lot.","Difficulty":"Easy","Description":"Walking through space to mars, you will see stars and martians. There is no comparing the greenness of the aliens, and their work on mars creates an awesome place to explore. Have fun going back in time and changing the past, or seeing the ultimite end of human life from a distance. It's all fun and games when it comes to the this marian trip. This is a fake description","Clue7":"From the bench take a northwest stride,\nTo a restful place when you're outside.\nSit and gaze at the river view,\nIt's a lovely spot for me and you.","Clue13":"When you're near the waterfall,\nA good place to sit is on the wall.\nLook behind you for a plaque on stone,\nWhen did this park become RMOLL's home? __ __ __ __\n\t\t\t\t\t\t\t                B","Clue1":"To get there: Proceed north onto Main Street in Keene from the intersection of Routes 9, 12, and 101. Go though four lights and around the common. At the light, take a right onto West Street.","Clue6":"Look at the words and then look right,\nHis old smokestacks will be in your sight.\nWrite them here if you have spied\nThe last two numbers of the year he died. __ __\n\t\t\t\t\t\t                      A","Bring":"Binoculars","Clue15":"Seek a shelter made of wood,\nNot a house, but for tools it's good.\n'Round the back 'till water you see,\nThat is where the treasure will be!","Clue10":"When the forest comes to an end,\nThe path goes straight, but it also bends.\nTake a left, stroll down the hill,\nSoon you see smokestacks of Colony Mill."},"Quest6":{"Special Features":"Natural","Clue3":"Park by the green dumpster\nAnd walk 15 paces.\nNow turn to the right,\nOur playground your body faces.","Walking Conditions":"Trail","Description":"Walking through space to mars, you will see stars and martians. There is no comparing the greenness of the aliens, and their work on mars creates an awesome place to explore. Have fun going back in time and changing the past, or seeing the ultimite end of human life from a distance. It's all fun and games when it comes to the this marian trip. This is a fake description","Clue1":"To get there: Take Exit 13 off I-89 and follow Route 10 south through Grantham until you reach Croydon village.  The schoolhouse is surrounded by a white picket fence, and on your right.","Clue8":"You've walked the size of our school\nNow face the red door.\nThe Valley Quest treasure you seek\nIs under the porch floor!","Season":"May-Oct ","Clue6":"Now go past the big tire\nTo the left of the path.\nCount up 35 paces,\nCount as if you're in math. ","Location":"Croydon, NH","Bring":"Binoculars","Clue4":"On your way to the building's end\nA chimney you will see.\nA woodstove they used,\nThat is where it would be.","Duration":"30","Clue2":"Built in 1790\nOur school is very old.\nYou can tell by the bricks\nWe're sure you've been told.","Title":"Croydon Schoolhouse Quest","Clue7":"Notice the white picket fence\nAnd the little bell tower.\nIt's rung at recess end\nBut not on the hour.","Difficulty":"Easy","Clue5":"When you've reached the corner\nLeft is how you should face.\nDo you see the picnic table?\nGo to that place."},"Quest13":{"Clue5":"We're now in a mast producing zone--\nA fancy way of saying nuts call this place home.","Clue17":"Taking that distance look 'round for a hole\nWhere you'll find your answeróbut don't tell a soul!","Title":"Miraculous Trees Quest","Clue12":"An apple tree looms left flanking the road.\nIn fall it will bear a tasty load.\nIf soon you pass the numbers 369\nI can tell that you are doing fine.\n","Clue4":"Leaving the highway noise behind\nSeven feet up on Allbee a finger pointing up find.\nThen a baseball diamond sitting on home\nSlink under the line, & left up the road roam!","Clue9":"Our fork holds two poles in its crest--\nVeering left I think is the best.\nThe next big tree on the right is a white ash.\nHow do we know?","Clue14":"Beyond the birch is a majestic tree.\nOh tell me what you think it might be?\nDespite a very terrible blight","Special Features":"Natural","Clue3":"Rounded, lobed leaves can be found\nEither upon me-or upon the ground.\nPlease measure my waist, up four feet \nIn order to calculate the DBH-hey that's neat!","Clue8":"Onward!  Sugar maple, beech \nAnd yellow birch are the other three-\nOh say how many can you see?\nCurve left. Threadbare from the years\nAn old yellow birch stands right near 675\nLooking ragged-yet it is still alive.","Season":"May-Oct ","Location":"Fairlee, VT (in village of Ely)","Clue16":"Now examine the nuts, the bark, buds and leaves-\nFor then you will see how to SEE this rare tree!\nTo find out the name of the tree you have found\nAdd up the DBH's and then measure the ground.","Clue11":"You'll pass a sugar shack on the left\nAnd a front yard spruce on the right\nBut stay straight ahead\nWith your goal still out of sight.","Duration":"30","Walking Conditions":"Trail","Clue2":"I stand in back with wide, stretching arms\nProtecting all here from harm.\nMy family is oak, my color white-\nA compatriot stands next to me on the right.","Difficulty":"Easy","Description":"Walking through space to mars, you will see stars and martians. There is no comparing the greenness of the aliens, and their work on mars creates an awesome place to explore. Have fun going back in time and changing the past, or seeing the ultimite end of human life from a distance. It's all fun and games when it comes to the this marian trip. This is a fake description","Clue7":"The road curves right past a pole   \nAnd the tall, twin hemlocks.\nHemlocks are one of the four\nDominant northern forest trees\nGrowing up here among the rocks.","Clue13":"Then, uphill on the right \nThree white birch sit tight.\nJust past them is a driveway\nWhich we will turn up today.","Clue1":"To get there: Take Route 5 either south from Fairlee or north from East Thetford to the village of Ely.  From Ely, take Route 244 west underneath I 91 to Bragg Hill Road.  Turn right on Bragg Hill Road and follow it to the end.  Park at the cemetery--your Quest begins there. Remember to bring a measuring tape.","Bring":"Binoculars","Clue6":"Curving to the right\nLook through beech on your left.\nA road meanders lower, tracing the ravine\nWhere during the Pleistocene \nThe Ely River could be seen.","Clue15":"Still stands living in our sight!\nA miraculous tree!\nA sight rare to see!","Clue10":"Like muskmelon its bark does grow!\nWhat do folks do with a tree like that?\nMake hockey sticks or a baseball bat."},"Quest100":{"Special Features":"Natural","Description":"Walking through space to mars, you will see stars and martians. There is no comparing the greenness of the aliens, and their work on mars creates an awesome place to explore. Have fun going back in time and changing the past, or seeing the ultimite end of human life from a distance. It's all fun and games when it comes to the this marian trip. This is a fake description","Walking Conditions":"Trail","Clue3":"Between the Grange Hall and the Congregational Church\nSits a small house with a six post porch.\nFrom 1812-1817 this was the Noyes & Hayes store.\u000bDo you know what Mr. Hayes' son was famous for?","Clue1":"To get there: Take I-91 to Exit 4.  Drive south on Route 5 to Schoolhouse Road. Turn west (right) onto Schoolhouse and travel 2 miles to Dummerston Center (a 4-way stop).  Turn left and park in the Dummerston Town Office parking lot.","Clue8":"Continue past an 1811 cape with roof of slate,\nAnd beyond to where writhing locusts await.\nTurn left onto dirt and head towards the stones,\nWhere Dummerston elders rest their weary bones.","Season":"May-Oct ","Clue10":"Many of Dummerston's original names and dates\nCan be found here carved in fieldstone, marble, and slate.\nLook back towards the center of town\nIn a small box on a tree, your treasure will be found!\nChanged spelling","Clue6":"Follow the edge of the trees heading east\nThen carefully cross to the far side of the street.\nTurn right and head down the hill,\nAcross from the yellow sign please stand still.","Location":"Dummerston, VT","Bring":"Binoculars","Clue4":"Head back to the south, past big maples A and B.\nStop when you come to the edge of the trees.\nHere once stood Asa Knight's tavern and store,\nFolks bought salt, cotton, spices, rum, molasses and more.\n\u000bAsa Knight's store was moved in 1972.","Duration":"30","Clue2":"Walk across the Dummerston Center green\nWhere an ancient, gnarled maple looms over the scene.\nLook back past your car to the 1st school house\nThe historical society meets there now.\n\u000bThis building once sat across the street\nAt a site very near to your feet!\nMake a 90 degree turn to the right,\nThen walk to the monument of a very big fight.","Clue9":"Enter the gap and follow the stone wall to the back.\nPretty soon you will find a \"table top\" flat.\nRemember the stones that disappeared?\nThe bones and stones were moved right here.","Title":"The Dummerston Center Quest","Difficulty":"Easy","Clue7":"Turn eyes left the old road bed to observe,\nWhich took the steepness out of this curve.\nNow, cars cruise back and forth on our town's paved roads;\nBefore, on dirt tracks, horses hauled people and loads.","Clue5":"In Old Sturbridge Village it is there to view.\nSomewhere along this side of \"the green\"\nThe town cemetery could once be seen.\n\u000bLeonard Spaulding and other original settlers were buried here,\nBut then their stones-they disappeared!\n\nWhere did they go?"},"Quest18":{"Clue5":"To get there pass the columns four\nAnd you'll find yourself at the chapel next door.","Title":"Amphitheater Quest","Clue12":"Near the wall without graffiti there is a pipe on the ground\nAnd within the deep darkness your treasure can be found.","Clue4":"If the hour hand is facing III\nYou'll be heading in the direction of the place with a \"B.\"","Clue9":"Foot travelers know they are headed the right way\nAs they pass a crooked arm reaching up and away.","Special Features":"Natural","Clue3":"Now find the building with a pine tree on top\nThen look below to find a clock.","Clue8":"Straight ahead a dirt path doth lie\nWith tall white pines over to one side.","Season":"May-Oct ","Location":"Hanover, NH","Clue11":"Walk straight through the amphitheater to the other side\nThrough a rectangular opening where the treasure hides.","Duration":"30","Walking Conditions":"Trail","Clue2":"Start in the middle of the green\nWhere a lot of students can be seen.","Difficulty":"Easy","Description":"Walking through space to mars, you will see stars and martians. There is no comparing the greenness of the aliens, and their work on mars creates an awesome place to explore. Have fun going back in time and changing the past, or seeing the ultimite end of human life from a distance. It's all fun and games when it comes to the this marian trip. This is a fake description","Clue7":"The stone walk you're on will lead you right by\nFour tall white houses sitting on your right side.","GPS":"43.7022451,-72.28955259999998","Clue1":"To get there: This Quest starts in the middle of the Dartmouth College green.  Take 91 to exit 13, travel east across the Connecticut River, and up the hill on West Wheelock.  The green is at the top of the hill on your left.","Clue6":"Bells and arcs and faces hidden behind colored glass\nWill look at you as you casually stroll past.","Bring":"Binoculars","Clue10":"Enter a clearing and lying straight ahead\nTwo trees: one a memory, and one tall and not dead."},"Quest5":{"Clue5":"Walk down the bank, right near your car,\nLook to your left, but not too far.\nA sight to behold,with moss like mold.\nThere is a bridge, the oldest of stone,\nIn these here parts of our Cornish home.","Title":"Jonathan Wyman Saw Mill Quest","Clue12":"Retrace your steps back to the stream.\nRecross the bridge as if in a dream.\nHeading south, the mill wall will be on your left.\nIt's tower still stands, looking bereft.","Clue4":"After you park, take a quick look\nWhere a fall of water becomes a brook.\nIt's privately owned, so to do what's best\nJust eyes should admire this part of the Quest.","Clue9":"Cross the bridge, and walk on 'til you come to a fork.\nThe path divides, choose the right and head down by the brook.\n90 steps more to the base of a hill\nA stump and a stone downstream from the mill.","Special Features":"Natural","Clue3":"Take West Pass Road .6 mile until you come to the stone bridge with a waterfall on your left.  Park in the small parking area on your right, just before the bridge. Your Quest begins there.  Please note that the waterfall is privately owned and not part of this Quest.","Clue8":"Around to the right, foot bridge in sight,\nA slippery flat rock, a sigh that says \"Bach.\"\nYou're on your way for a day of play.\nBut before you rest there is more to this Quest.","Season":"May-Oct ","Location":"Cornish, NH","Clue11":"Feel peace surround you as you walk in,\nFor you are someplace you have never been.\nA brook and a waterfall are things you will here,\nA birdsong, leaves crackle, a glimpse of a deer.\nA nice place to picnic would be right here.","Duration":"30","Clue2":"Proceed up School Street to the G. H. Stowell Free Library, a large, red brick building on your right.  After .2 miles bear left onto Leavitt Hill Road.  Continue up the road, bearing right, for another .4 mile until you come to a fork and see the sign for West Pass Road on your right.","Difficulty":"Easy","Clue7":"Walk past logs, long been felled\nTheir neighbors know the secrets held.\nHead down the hill to the mill,\nAll that is left, stones standing still.","Description":"Walking through space to mars, you will see stars and martians. There is no comparing the greenness of the aliens, and their work on mars creates an awesome place to explore. Have fun going back in time and changing the past, or seeing the ultimite end of human life from a distance. It's all fun and games when it comes to the this marian trip. This is a fake description","Clue13":"Climb up the step in the mill, from there, five steps more.\nWatch out! Don't fall! Find the hole in the wall.\nYour eyes looking left, about five feet tall-\nThe box will be there, the treasure and all!","Clue1":"To get there: Travel on Route 120 to Cornish Flat.  Find the corner of Upper East Road and School Street, at the east side of the triangular common area, across from the Cornish General Store.","Clue6":"Back up to the path where brambles grow,\nAncestor of brambles that long ago\nKnew men who worked, come rain or snow,\nMaking these woods what we now know.\n","Bring":"Binoculars","Clue10":"Take a compass bearing 153 degrees south.\n(Turn 180 degrees, if compass you doubt)\nLook through the tress, past the thick forest floor.\nA semi circle of stones awaits by the shore."},"Quest22":{"Special Features":"Natural","Clue3":"Cross the road & look for the sign.\nThere are the colored blazes you must find.\nStart here for adventure & soon you will see\nA great, big, old \"W\" tree.","Walking Conditions":"Trail","Description":"Walking through space to mars, you will see stars and martians. There is no comparing the greenness of the aliens, and their work on mars creates an awesome place to explore. Have fun going back in time and changing the past, or seeing the ultimite end of human life from a distance. It's all fun and games when it comes to the this marian trip. This is a fake description","Clue1":"To get there: From Hanover, take East Wheelock Street over the hill and down to Etna, about four and a half miles.  Where the road ends, turn left, onto Etna Road.  Continue half a mile, past the Etna General Store, to Ruddsboro Road, and turn right.","Clue8":"Now look for a large, southerly pine.\nUnder some rocks our box you will find.","Season":"May-Oct ","Clue6":"Walk half a mile, past Harris Trail\nThen follow white blazes-you will not fail\nTo pass a swamp and begin your climb.\nNow it becomes a strenuous time!","Location":"Hanover, NH","Bring":"Binoculars","Clue4":"Continue along, and you will have found\nThat when you climb up THIS mountain\nFirst you go DOWN!","Duration":"30","Clue2":"After one and a half miles, turn left onto Three Mile Road.  Continue about one mile, until you see a small parking area on your left, where the Appalachian Trail crosses the road.  Park here.  The trail is on your right.","Clue9":"You have succeeded in your Valley Quest hike\nArmed with will power, strength and the like.\nSuccess is gratifying to all of us who\nCommit time and effort and desire to DO!","Title":"Moose Mountain Quest","Clue7":"Nearing the top are hemlock trees.\nAt the summit turn south and you will see\nA most marvelous view: mountains, rivers & ponds\nA view created, it seems, as if by a magician's wand.","Difficulty":"Easy","Clue5":"Across a creek, then you must creep \nBut be careful-don't wake the moose \nFrom his sleep!"},"Quest4":{"Special Features":"Natural","Clue3":"Look to your right,\nA flat stone's in sight.\nA big eye can be found\nJust above ground.\nYou should be in the place\nWhere Jonathan Chase\nlies underground\nSix feet down.","Walking Conditions":"Trail","Description":"Walking through space to mars, you will see stars and martians. There is no comparing the greenness of the aliens, and their work on mars creates an awesome place to explore. Have fun going back in time and changing the past, or seeing the ultimite end of human life from a distance. It's all fun and games when it comes to the this marian trip. This is a fake description","Clue1":"To get there: From the New Hampshire side of the Cornish Windsor Covered Bridge, travel south on 12A past Town House Road.  Stay south on 12A.  The church is on the left as you climb up the hill, approximately 1\/4 mile south of the bridge.","Season":"May-Oct ","Clue6":"Shining lights, big green door,\nThree tall windows, shutters galore.\nWalk through the door,\nAnd then one more--\nTo where ministers stand, pray with their hands.","Location":"Cornish, NH","Bring":"Binoculars","Clue4":"A key, a cross\nof skull and bones\nThese are the things\nThat Jonathan now owns.","Duration":"30","Clue2":"Park your car\nDon't go far.\nHead for the stones,\nLook out!\nThere are some bones\nBelow you.Trinity Cemetery is where you'll be.\nAn obelisk stone is what you'll see.\nIt is real tall,\nOld Israel Hall.\nCount five rows back and please don't slack.","Title":"Trinity Church Quest","Clue7":"Turn around and walk west,\nHead for the chest.\nIt's on the right-\nTreasure's almost in sight!\nOpen a drawer,\nAnd there's your reward!","Difficulty":"Easy","Clue5":"Go back to the Church\nTowards Mount Ascutney\nRed, white and blue is what you'll see,\nAnd a stump of a tree near Church Trinity."},"Quest12":{"Clue5":"A tree broken in half\nCrosses the path.\nHere comes some water\nBut don't stop for a bath.","Title":"Fairlee Glen Falls Quest","Clue12":"After signing our guest book\nGo close, take a look for yourself\nAnd give it three cheers!\n","Clue4":"You'll see a white rock\nBut please do not stop.\nIf you keep on the trail\nWe're sure you'll not fail.","Clue9":"Now find an upturned root,\nSuch a beautiful sight\n(Like a Giant's hand,\nBut please don't feel fright.) ","Special Features":"Natural","Clue3":"Walk about 70 steps\n(From the sign)\nAnd cross the street\nThe woodland opening\nShould be right at your feet.","Clue8":"When you find the 2nd orange \nmarker along your way\n\"Turn right and 30 steps,\"\nthat's what we say. \n","Season":"May-Oct ","Location":"Fairlee, VT","Clue11":"Visitors have enjoyed \nFairlee Glen Falls\nFor more than 100 years.","Duration":"30","Walking Conditions":"Trail","Clue2":"Park at the boat launch\nBe sure you're all set\nStep o'er the \"road-fence\"\nAnd turn to the left.","Difficulty":"Easy","Description":"Walking through space to mars, you will see stars and martians. There is no comparing the greenness of the aliens, and their work on mars creates an awesome place to explore. Have fun going back in time and changing the past, or seeing the ultimite end of human life from a distance. It's all fun and games when it comes to the this marian trip. This is a fake description","Clue7":"Pass the gall.\nIt looks like a beach ball!\n","Clue1":"To get there: Take I 91 to the Fairlee Exit (15), turn West and take Lake Morey West Drive 1.4 miles (around Lake Morey)  to the Boat Launch. The Quest begins there. Please do not park in the driveway across from the trailhead-this is private property.","Clue6":"Keep on the path...\nYou'll see a waterfall.\nBut it's just the lower one\nAnd not tall at all.\n","Bring":"Binoculars","Clue10":"Facing towards the Upper Falls\nA slanted stump will\nAppear on your right.\nWalk 22 steps and look down \nTo discover our Quest's\nTreasure Box site.\n"},"Quest95":{"Clue5":"Proceed to the fanciest porch on Main Street.\nHow many acorns are found in each arch?\nSitting here you could see the school band march.\nBuilt in Eighteen thirty-two this home is so sweet.\n\nThe covered sitting place is called a ___ ___ ___ ___ ___\n\t\t\t\t\t                3","Title":"Chelsea Shiretown Quest","Clue12":"Next door, the second floor, is the Masonic Lodge.\nIt was build in Nineteen Nineteen.\nDixie's next door is a great scene.\nBeautiful red bricks with inlaid arches-quite odd.\n\nLetters on the lodge are the color of ___ ___ ___ ___\n\t\t\t\t\t                      9","Clue4":"Turn southwest to a house once famed for its gardens.\nIt was build by Hall in Eighteen Thirty.\nSee what's left of the old elm tree.\nHall rounded Cape Horn, farmed here, and raised hens.\n\nWhat is to the left of the old stump?  Stone ___ ___ ___ ___ ___\n\t\t\t\t\t\t                                2","Clue9":"In front of Bacon and Hall you should now be.\nOnce burned by flames, but again like new.\nIt was rebuilt in eighteen ninety-two.\nBacon financed this building. Look up to see!\n\nThe machine that flows with dough is called a ___. ___. ___.\n\t\t\t\t                             6","Clue14":"Keep pacing north to the mills where grist was ground.\nIn 1927 the flood blew through\nIt took the mill works with it too.\nCollect the letter that repeats thrice, it's easily found:  ___\n\t\t\t\t\t\t                                    10","Special Features":"Natural","Clue3":"On the South Common look up and you will see\nA golden dome shining like the sun\nMaking us the Shiretown, a special one.\nJudicial sessions keep us so safe and free.\n\nLook for the letter that appears in each word.  Write it here:   ___\n\t\t\t\t\t\t\t\t  1","Clue8":"Hammers, nails, buckets, screws-so many things that you could use.\nThis building, built way back in Eighteen Eighty-five\nWas called \"Tracy's\" & sold things people used in their lives.\nNow, Chelsea folks go here to wash clothes of many different hues.\n\nTo wash clothes they walk up the","Season":"May-Oct ","Location":"Chelsea, VT","Clue16":"I need some… And your Quest is done for the day!","Clue11":"On the corner's a place where we check out books.\nRound on two corners, it's plain to see.\nWhen you are here, you must whisper quietly.\nA sign above the front door is where you should look.\n\nThe 1st letter of the 5th word: ___ ___ ___ ___ ___ ___\n \t\t\t                              8","Duration":"30","Walking Conditions":"Trail","Clue2":"Chelsea Shiretown has secrets to share with you.\nTo start our quest on this fine day\nTravel to the south green I say\nAnd arrive at the court to solve your first clue.","Difficulty":"Easy","Description":"Walking through space to mars, you will see stars and martians. There is no comparing the greenness of the aliens, and their work on mars creates an awesome place to explore. Have fun going back in time and changing the past, or seeing the ultimite end of human life from a distance. It's all fun and games when it comes to the this marian trip. This is a fake description","Clue7":"\"Turn and walk north\" the Chelsea fifth graders sung.\nOn your right still can be seen\nThis Shiretown's South Green\nAnd where Rebecca Peake was never hung.","Clue13":"Two houses beyond, there I am with white waves.\nBehind me is where we go to get grain.\nI once sold gas, but no more, it's a shame.\nAcross the road, do you see the house for the aged?","Clue1":"To get there:  You can reach Chelsea via Vermont Route 110 (heading north from South Royalton) or Vermont Route 113 (traveling northwest from Thetford).  The Quest begins on Chelsea's South Green, in front of the Court House.","Clue6":"Walk south, some \"fans\" to cool you down?  Not this kind in Chelsea town!\nLook for this \"fan\" over a brick house's doorway.\nThis fine homestead was built in 1832 they say.\nTwo beautiful elm trees that sat in the front yard were cut down.\n\nThe place you are at is called the ___ ___ ___ ___ ___      ___ ___ ___ ___ ___\n\t\t\t\t\t                 4","Bring":"Binoculars","Clue15":"Turn around and skip down to Will's store.\nThis was the place to go when you were sick!\nWill's was built out of old school brick,\nAnd we hope this Quest wasnít a big bore.\n\nGo in to the store and then say-\n\"I'm feeling quite ill\"","Clue10":"Now cross over Route One Thirteen to the north green.\nDon't take the sidewalk-meander towards the clock.\nTo where the eagle perches please continue to walk.\nOn top of Eighteen twelve this \"pointer\" can be seen.\n\nA pointer like this is called a ___ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___\n\t\t\t                                         7"},"Quest102":{"Clue5":"Follow the telephone wires\n(Really, we aren't liars)\nUntil you get to the next pole.\nBe careful you don't trip in a hole.\nThen use your common sense","Title":"Lake Morey Quest","Clue4":"Don't miss the granite posts at night!\nWalk beyond the house to the power tower.\nIn the woods you will see a hole.\nWalk on through to find the next clue.\nDon't walk into door number four.\nTurn right and wander round some more.","Clue9":"Then turn right onto Brennan Road.\nFollow the spruce trees,\nBut don't break them, please.\nLook for a mound...\u000bIt's almost round.\nTake a left on Country Club Road,\nProceed until you see a lawn that's mowed.","Special Features":"Natural","Clue3":"For this event, park your car facing the fence.\nNext, keep the highway on your right\nAnd walk past the poles of light.\nThe row of trees will give you delight.\nDonít get hurt as you step on to the dirt.\nPines on your left, oaks on your right,","Clue8":"Next, count 13 posts\nBut don't expect an unlucky ghost.\nCross the road to the right\nTake in a beautiful sight.\nTurn to your left and \nGo eight more posts.\u000b","Season":"May-Oct ","Location":"Fairlee, VT","Clue11":"If you look carefully, you might find a snail.\nIn an old sap bucket your prize will be hidden\nSlip back the cover, it's not forbidden.\nWe hope it wasn't hard to follow our rhyme\nAnd we hope that you had a wonderful time.","Duration":"30","Walking Conditions":"Trail","Clue2":"Head north on Route 5 until you see a sign for School Street (just beyond the post office).  Follow School Street to the Samuel Morey Elementary School parking lot.\n","Difficulty":"Easy","Description":"Walking through space to mars, you will see stars and martians. There is no comparing the greenness of the aliens, and their work on mars creates an awesome place to explore. Have fun going back in time and changing the past, or seeing the ultimite end of human life from a distance. It's all fun and games when it comes to the this marian trip. This is a fake description","Clue7":"Walk 'til you see a blue snake on a staff\nI'm not kidding, so please don't laugh.\nCross to the left, and follow trees in a long line.\nCount them yourself, there are eighty-nine.\nDon't get tense\nFollow the split rail fence.","Clue1":"To get there: Take Exit 15 off of I-91.  At the bottom of the ramp, turn east.  Stop at the STOP sign.  Then turn left (north) on Route 5. ","Clue6":"Follow right, but don't trip on the small chain fence.\nLook for the Thetford 7, Bradford 6 sign.\nIf you see it, you're doing just fine.\nPause and admire the ridges\nThen pass under the two bridges.","Bring":"Binoculars","Clue10":"From the Fairlee Beach, where water flows from the lake,\nFurther on Country Club is the path you should take.\nFollow the fence to a row of stones\nAnd then spy a bench where you can rest your bones.\nBy the side of the small brook, look for a trai"},"Quest17":{"Clue5":"Find the house with the number 52,\nA very old house it is.\nMr. Walker's parents lived there long ago,\nThis house now is his.","Clue17":"Their monument is made from granite,\nIt is the tallest in the yard.\nUpon the top is an urn and shroud,\nA Smith family memorial \nStanding guard.","Title":"Dunbar Hill Cemetery Quest\nGrantham, NH\n\nTo get there: Take Exit 13 off Rte. 89 and travel south on Rte. 10 towards the center of Grantham.  From the center of town, look for a sign for Grantham Village School and turn left onto Springfield Road\/Rte. 114. Continue until a sharp bend in the road and another sign for the school. Continue on Learning Drive into the school's parking lot.","Clue12":"Twisting and turning, a driveway like an 'S- \nThe person who lives here, helped developed the Quest.","Clue4":"Over the flowing Sugar River,\nCross the bridge of steel,\nIt winds its way north and south,\nA trout haven to conce","Clue9":"Climb a quarter of the way up the \nEnormous hill, you'll find two rocks to rest.\nIn case you are tired, you-ll want to know,\nYou are halfway through our Quest.","Clue14":"Dunbar Hill Road becomes \nCote Road, joining together to become one.\nIf you find the Sugar Springs Farm sign,\nYour Quest is almost done.\n","Special Features":"Natural","Clue3":"On top of a boulder, near the cemetery, \nThere is a plaque filled with history.\nIt-s hunter green with white letters \nDeclaring us to be free.\n","Clue8":"This structure was built during the Civil War.\nIt once was a two room school.\nThe building now houses the town offices,\nAnd the police that enforce the Grantham rules.","Season":"May-Oct ","Location":"Grantham, NH","Clue16":"Go to the slate grave with two rusty bars,\nTreat this site with respect and care.\nThe stone bears the year 1866.\nHannah is buried there.","Clue11":"Look for the Field and Sons' trucks,\nOver on the right.\nFollow the road that bends 90 degrees,\nYour Quest is almost in sight.","Duration":"30","Walking Conditions":"Trail","Clue2":"Our school used to be only four rooms-\n1983 was that year-\nUntil the addition came along \nCreating the school you see here.","Difficulty":"Easy","Description":"Walking through space to mars, you will see stars and martians. There is no comparing the greenness of the aliens, and their work on mars creates an awesome place to explore. Have fun going back in time and changing the past, or seeing the ultimite end of human life from a distance. It's all fun and games when it comes to the this marian trip. This is a fake description","Clue7":"Cross Route 10 over to Dunbar Hill,\nThere you will find many signs.\nWalk up along the paved road,\nYou-ll find words and letters of all kinds.","Clue18":"Carved in smooth stone,\nFrench was their last name.\nLook behind the big maple tree,\nYou'll find the Quest Box to claim.","Clue13":"Two brown houses up a long driveway,\nLined with many trees,\nUpon a steep and hilly lawn,\nA stone wall surrounds these properties.\n","Bring":"Binoculars","Clue1":"To get there: Take Exit 13 off Rte. 89 and travel south on Rte. 10 towards the center of Grantham.  From the center of town, look for a sign for Grantham Village School and turn left onto Springfield Road\/Rte. 114. Continue until a sharp bend in the road and another sign for the school. Continue on Learning Drive into the school's parking lot.  ","Clue6":"Our town has been standing over 200 years,\nIt certainly has been a long time,\nWe settled here the 8th of June,\nWhen wages were close to a dime","Clue15":"You'll see a stone wall across the way,\nGo through the lower gate.\nThe graveyard here is very old,\nIt is filled with stones of slate.","Clue10":"You'll see a house of gold\nGoing half way up the hill.\nA windmill spining round and round,\nAnd ornaments the lawn does fill.\n"},"Quest3":{"Special Features":"Natural","Clue3":"Look out at our pond\nOf which we are fond.\nCattails and lilies swing and sway.\nBlackbirds and fishies like to play.\n\nNow walk south 180 steps to the blue railing.","Walking Conditions":"Trail","Description":"Walking through space to mars, you will see stars and martians. There is no comparing the greenness of the aliens, and their work on mars creates an awesome place to explore. Have fun going back in time and changing the past, or seeing the ultimite end of human life from a distance. It's all fun and games when it comes to the this marian trip. This is a fake description","Clue1":"To get there: Drive about 10 miles south of Lebanon on Rte. 12A and park at the pull off on the east (left) side of the road at the Mill, approximately 1\/4 mile north of St. Gaudens Rd.","Clue8":"Now back to the green sign.\nAnd then south along the railing-\nKeeping cars and traffic carefully in mind!","Season":"May-Oct ","Clue6":"Sit down on the wall.\nMake sure you don't fall.\nOn this very sill,\nThere used to be a mill.\nThe water rushed on in.\nThe mill wheel it did spin.","Location":"Cornish, NH","Bring":"Binoculars","Clue4":"You're at something blue,\nThat doesn't stick like glue.\nSo don't lean over the bar\nOr you'll be too far\nOver the dam,\nOn the rocks you will slam.","Duration":"30","Clue2":"Walk to the green sign,\nAs we say our rhyme.\nWith the sign at your back, \nWalk north 135 steps.","Clue9":"Pass the mill, and the stone arch,\nAnd then turn left when the guardrail departs.\n\nFollow the high wires to the brown walking square.\nAnd at the end of the curve of rocks-look under there.","Title":"Blow Me Down Mill Quest","Clue7":"Now walk south to the end of the wall. \nGo down inside 25 steps to the door up high. \nLook up, look down, and look all around\nTo see and learn about what you have found.","Difficulty":"Easy","Clue5":"Walk 10 steps west, then 20 steps south."},"Quest110":{"Clue5":"Walk past a road called Sugartop. \nPass a field once filled with cow plop.\nHead for an old bucket with a post. \nIn this white house you may find a ghost.\nBuilt in 1788","Clue17":"Down on the right is a big farmstead\nYou can guess the old owner if you use your head. \nMore Hazen land left to a daughter you see. \nTurn around now and done with this Quest you'll be.","Title":"Jericho Historic District Quest","Clue12":"Walk to the mailbox, are your feet sore? \nNote the tile roof and the green latch door. \nBelieve it or not, another Hazen house \nGiven to a daughter and her spouse. \nWilliam Pixley was her husband's name\nHe, of course, was a farmer just the same.","Clue4":"Thomas Hazen once owned all this land. \nIt was a gift from the town for lending his hand. \nHe gave it all out to his children \nWho quickly started a buildin'.\nCome along and see \nTheir fine legacy.  ","Clue9":"This was once a one-room school. \nLook inside, isn't it cool?\nPicture Ray Miller in a blast from the past. \nHe is now a farmer but this was once his class.","Clue19":"Look around on the ground \nUnderneath something round \nFor rewarded you will be \nWith the treasure you see. ","Clue14":"Walk to the door where the farmer goes in\nThis foundation of stone is stronger than tin.\nNumber 3937 is what you need next\nIf you can't find it don't be vexed.","Special Features":"Natural","Clue3":"Join us with our journey \nAs we make our way through the history\nOf Jericho District farms \nThat you can see in houses and barns.","Clue8":"Cross the street headed west and you will see \nPhilemon's second house built with brick in 1823.  \nIt was later owned and farmed by a Lyman \nSeek out the community house while we keep on rhyming.'  ","Season":"May-Oct ","Location":"Jericho, VT","Clue16":"Down the road you need to go. \nIt's the final farmstead don't you know? \nPass the house and keep on moving\nTo finish this Quest you need to keep grooving.","Clue11":"Go back to the road and finish this trip. \nLook for a big red barn and be sure not to slip. \nAs you travel, check those fields out now. \nThey once held apple trees, sheep and many a cow.\nWhile you cruise on up the hill \nSearch for 1912 if you will.","Duration":"30","Walking Conditions":"Trail","Difficulty":"Easy","Clue2":"Proceed until you get to Sugartop Road on your left. Shortly beyond Sugartop Road is a pullout for parking. Park there and embark on your Quest.","Description":"Walking through space to mars, you will see stars and martians. There is no comparing the greenness of the aliens, and their work on mars creates an awesome place to explore. Have fun going back in time and changing the past, or seeing the ultimite end of human life from a distance. It's all fun and games when it comes to the this marian trip. This is a fake description","Clue7":"Now move along to the house of Philemon.\nWho was another that Mr. Hazen called \"son.\"\nHe lived past Wallace road so fine \nIn his white house built in 1789. \nNote the old wooden latch door.\nLong ago this house held a small store.","Clue18":"Head back to the middle\nOf this historic riddle. \nThe place where kids once learned \nIs hiding the treasure you've earned.","Clue13":"Keep on moving down the hill \nIt will take awhile, so just chill. \nUpon an old red barn you will stumble\nLook for broken windows about to crumble.","Bring":"Binoculars","Clue1":"To Get There:  From Hartford Village travel west on Route 14 for 1.8 miles. Turn right onto Jericho Road and follow it until it ends. Then, take a right onto Jericho Street.","Clue6":"It was owned by son Daniel of late.\nLater on, Erminie Nott called it her own.\nAs a school teacher she was well known\nIn the one-room school just down the street\nWhere in a few minutes we'll take your feet. ","Clue15":"Thomas Savage owned this space\nIn 1784 his son claimed it his place. \nA dairy farm until 1954 \nFrom that year on there were cows no more.","Clue10":"Neighbor Norman Lyman also went here. \nHis family has been around for many a year. \nBoth men spent their lives in this community \nAnd have stories to tell of its great unity.  "},"Quest46":{"Clue5":"See the wagon wheel made of rusty steel.\nWalk around a corner for the next clue. A sign with purple flowers that you see begins with \"ME\".","Title":"Quechee Gorge Quest\nQuechee, VT\n\nTo get there: This Quest begins at the parking lot for Quechee Gorge Gift Shop and Ott Dog. It is located just east of Quechee Gorge off Rte. 4 and about .8 mile east from the blinking light of Quechee Village.","Clue4":"Find the \"OVERLOOK PICNIC\" sign. Which ever way the sign is facing, start your pacing.\nIf you feel fine, follow the yellow line.\nFrom the first, walk across approximately twenty-four rocks.","Clue9":"Then you will end up on a small stone ridge.\nIf you are not a dare devil, walk the lower level.","Special Features":"Natural","Clue3":"Walk down a tilting hill and you will see some cooking grills.\nLook for a Ranger's house and get ready to arrange yourselves.","Clue8":"Take a left, walk down the stairs and under the bridge,\n150 feet past the red diamond, go over the MOSSY ROOT RIDGE.\nTake 11 steps and turn left to go over a log bridge.","Season":"May-Oct ","Location":"Quechee, VT","Clue11":"With the tree on your right, walk across the clear land,\nMarching straight ahead, in 20 steps you will land.\nTurn right down the steep, deep slope, Oh boy! We hope you can cope!\nThere's a long rotting log on your right. It points just to the right of our secret site.\nLook down to a fat chopped off log--it's a chunk.  Behind it's our box--you've shown real spunk!","Duration":"30","Walking Conditions":"Trail","Clue2":"Walk past the well with a top. Walk by it then take a stroll and hop.\nClimb a short hill, look over a fence, but don't take a spill.\nTake a right. Walk a little while...everyone in single file.","Difficulty":"Easy","Description":"Walking through space to mars, you will see stars and martians. There is no comparing the greenness of the aliens, and their work on mars creates an awesome place to explore. Have fun going back in time and changing the past, or seeing the ultimite end of human life from a distance. It's all fun and games when it comes to the this marian trip. This is a fake description","Clue7":"Careful you don't fall down the hill or you'll get a doctor's bill.\nGo over the rail and you'll walk awhile against the traffic flow.\nCross but STOP! LOOK BOTH WAYS BEFORE YOU GO!\nTo follow on your track--on the other side go back.","Clue1":"To get there: This Quest begins at the parking lot for Quechee Gorge Gift Shop and Ott Dog. It is located just east of Quechee Gorge off Rte. 4 and about .8 mile east from the blinking light of Quechee Village.","Clue6":"Go across route 4, walk some more and find the green door.\nWalk a little farther--. Find the map that faces west to continue on your Quest.\nThe sign is info. on where to go-it says \"Quechee Polo\".\nFollow the rail that keeps you on the trail.","Bring":"Binoculars","Clue10":"Go up, LOOK,LOOK! to see a tall holey pine tree with no top,\nThen head up hill toward two o'clock.\nAfter 15 steps, stop and look right, a short holey topless tree will be in sight."},"Quest21":{"Clue5":"Each alder tree leaf scar has a round face with eyes\nAnd a tiny nose looks at you with surprise.\nAlder trees anchor stream banks, containing the motion.\nTheir roots are essential to preventing soil erosion.","Clue17":"Cross another soggy bridge and notice moss covered logs, some old and some new.\nFind the oldest you can and the youngest one too.","Title":"Mink Brook Quest\n","Clue12":"In the last week of April and first week of May,\nSuckers move up the brook, jumping up waterfalls so gay.\nContinue on this trail-following the blue arrow.\nIt's the main trail you want, not the one that is narrow.","Clue4":"An alder tree will be on your left as you look at the view.\nOn the right are tall willow trees, of which there are two.\nBoth of these tree species can be found by brooks.\nThey need soil, this moist, to help their good looks.  ","Clue9":"As you go on, European buckthorn is on the right,\nWhen it's thick it out-competes native plants for sunlight.\nIt also is a glutton for nutrients and space,\nSo wildlife loses native food at a far too rapid pace.\n","Clue19":"(To return to the parking lot, take a right.\nA \"Mink Brook Nature Preserve\" sign is in your sight.)","Clue14":"Animals move through here to the brook where they drink,\nTo their lives this habitat is a key link.","Special Features":"Natural","Clue3":"Wonderful at rodent control, mink can kill and store prey.\nYou may see mink hunting this shore one day!","Clue8":"The trail continues to a small meadow where ripples abound,\nA place where animal tracks can be found,\nOn the sandbar, raccoons, foxes, mink... even bear,\nHave left footprints when drinking and hunting with care.","Season":"May-Oct ","Location":"Hanover, NH","Clue16":"As you make the bend the land slopes up quite a bit.\nIn the springtime the wildflowers will be quite colorful, so sit!","Clue11":"On the trail a little further, pine and hemlock abound.\nContinue up the rise past a stone wall that follows the ground.\nTake a right onto the Brook Loop and enjoy the water again.\nIn early spring you'll find a lot of suckers here and their kin.","Duration":"30","Walking Conditions":"Trail","Difficulty":"Easy","Clue2":"Leave the parking lot and please come learn\nAbout mink, suckers, grape, and fern.\nSoon there will be a small trail on the right\nGo see the view of Mink Brook-it's a sight.","Description":"Walking through space to mars, you will see stars and martians. There is no comparing the greenness of the aliens, and their work on mars creates an awesome place to explore. Have fun going back in time and changing the past, or seeing the ultimite end of human life from a distance. It's all fun and games when it comes to the this marian trip. This is a fake description","Clue7":"Continue on the main trail, not two trails right.\nBend to the left where the crabapple tree is in sight.\nLook on both sides for the riverbank grape, a vine with tendrils to climb.\nGrouse, fox, turkey and other wildlife upon its fruit dine.\n","Clue18":"Now soon you are at an intersection again. Walk back eight paces.\nIn the stone wall is a hole, where the Quest box now faces.","Clue13":"Now at the intersection, the Quest you will not fail.\nYou must continue straight and take the Forest Trail. ","Bring":"Binoculars","Clue1":"To get there: Get off at Exit 13 on Interstate 91.  This is the Hanover, NH\/Norwich,VT Exit.  Go towards Hanover, crossing the Connecticut River.  At the top of the hill, turn right at the light onto Main Street.  In .6 miles, turn left onto Brook Road.  Continue on Brook Road for .2 miles.  Parking will be on your right. ","Clue6":"Return back to the main trail and continue 'til a house.\nListen to the sound of the water.  Be as quiet as a mouse.\nThis sound is made by bubbles breaking. \nUnder the rocks, animal homes in the making.","Clue15":"Walk until you find some giant pines, then cross a buried log bridge and find equisetum there. \nHorsetails is another name for this plant that is not rare.\nIt is useful for anchoring the soil. Look at it close.\nSee its jointed stems. It can poison livestock if they get too high a dose","Clue10":"To help with the problem, use native or non-invasive plants at home.\nNever release aquarium plants into streams, for the plants might roam.\nBe careful to remove all plant material from boats as well.\nThis keeps water milfoil, water chestnut, and zebra mussels from spreading, I tell."},"Quest107":{"Clue21":"Just take 9 steps up from the bottom of this \"valley,\"\nStop before you reach the pine row ahead.\nThough there's no path, turn right and let's rally\nKeep your eyes open and you won't be misled.","Clue5":"An old gravel path you will see,\nSo head down the shallow hillside.\nTo the right an ancient apple tree,\nRemnant of an orchard far and wide.","Clue17":"Erosion has affected this stream much,\nAs it is affected by every spring thaw.\nThe banks are unstable even to the touch,\nSo cross it carefully and without flaw.","Title":"White Pine Valley Quest","Clue12":"Soon up ahead you'll come to a junction,\nThe path nearest the ìWarning Challenge Courseî sign\nWill serve your function,\nSo head in that direction and you'll be just fine.","Clue23":"Walk towards this king of trees,\nAnd at the base a stump you will see.\nBend down and take one knee,\nFor at this stump your treasure will be.","Clue4":"Your Quest begin in this paved-over lot.\nBut where to go from here?\nTo search for the treasure that you have sought\nHead towards the woods so near.","Clue9":"To the left you will see\nFallen logs, rotten branches, and grasses tall.\nThese rotting remains offer nutrients to a tree,\nFor this detritus is nature's best nutrients of all.","Clue19":"Stay on this path and continue to climb,\nPast American beeches on your right.\nAnd continue straight past the old split pine.\nYou'll want to hurry before the mosquitoes start to bite!","Clue14":"Continue on this path and soon\nYou'll see the open pine grove up ahead.\nSun only gets into this grove at high noon\nTo warm the forest's bed.","Special Features":"Natural","Clue3":"At other times, parking is available in front of the schools.  Please note that the middle school and the high school both have back parking lots-your Quest begins from the HIGH school's back lot, which is the lower lot.","Clue8":"Keep moving down your gravel path and\nOver a chain, past a fence, and on the road.\nYou'll find White Pines tower over this land,\nOver some grass which has never been mowed.","Season":"May-Oct ","Location":"Quechee, VT","Clue16":"If you look further on,\nUp ahead you will see,\nA stream bed where the water sometimes is gone...\nThough in the spring this stream flows freely.","Clue20":"Soon the path up the hill fades,\nAt the half-cut-down tree another path will become clear.\nOver the valley to the left it wades,\nYou can almost smell the treasure it's so near!","Clue11":"On the left a little further up the way,\nA wood chip path you will cross.\nIt will lead you into the woods, which seem so dark and gray,\nBut do not be scared-these woods are kind.","Clue22":"In the small ccccclearing approximately 18 steps away,\nA giant \"wolf tree\" you will see,\nWhich ruled over the land in its day,\nFor its branches grew out wide, unlike the other pine trees.","Difficulty":"Easy","Walking Conditions":"Trail","Duration":"30","Description":"Walking through space to mars, you will see stars and martians. There is no comparing the greenness of the aliens, and their work on mars creates an awesome place to explore. Have fun going back in time and changing the past, or seeing the ultimite end of human life from a distance. It's all fun and games when it comes to the this marian trip. This is a fake description","Clue2":"Turn right just after you pass St. Denis Church and follow the road as it loops around to the back of the middle school.  Parking is available in the back when school is not in session.  ","Clue7":"All around the field there are\nTall grasses and shrubs, signs of\nSelected species-for their seeds travel far.\nThese plants are early succession, unlike towering trees above.","Clue18":"Up ahead there will be a bit of a bump-\nA small hill to climb in your route.\nStay on the path past the hole-y tree,\nA woodpecker's dinner out ","Bring":"Binoculars","Clue13":"***Soon up ahead, a path will appear\nIt lies just beyond the ìChallenge Courseî sign\nBut do not turn left or right my dear,\nKeep walking straight and you'll be just fine.","Clue1":"To Get There:  Take Exit 13 from I-91 and go east towards Hanover.  Cross Ledyard Bridge and at the top of the hill turn right onto Main Street.  Proceed to the next light and then turn left onto Lebanon Street. ","Clue6":"Continue on down this beaten path,\nTo your left a sporting field.\nDuring the year it's home to fun and laughs,\nTake a moment, sit on the bleachers, and yield.","Clue15":"This pine grove is of the latest succession,\nShowing a forest hundreds of years old.\nAll tall pines were of the ìking's possession,\nFor building ship mastsî the early settlers were told.","Clue10":"To the right a flowering stream you'll find,\nMany macroinvertebrates make this their home.\nContinue to follow the road and stream as they wind,\nBut stay on the path and be sure not to roam."},"Quest11":{"Clue5":"Now put your left side to Route 5\nAnd walk til you reach a gravel drive.\nYou'll see a row of trees.\nGo to the fifth one, if you please.\nJoseph Alger kept the trees trim,\nWe have learned a lot about him.","Clue17":"It told the trains to go or stop\nWith red and green lights mounted near to its top.\nThe station master got telegraph signals that said\nWhen a train would be straight ahead.","Title":"Fairlee Depot Quest","Clue12":"Go to the tracks and walk south 28 ties\nThere you will find an archeological surprise.\nGo a few yards west and dig lightly with your feet\nAnd beneath you will find a slab of concrete.","Clue4":"The Green Mountain Boy in 1848\nWas the very first train.  It sure was great!\nConnecticut & Passumpsic the company's name,\nMoving freight and passengers was its game.","Clue9":"Now follow the tracks to Bradford (north)\nOn this Quest by the 3rd and 4th.\nAfter 73 ties, turn west and stay loose\nThen walk 'til you reach a line of Spruce.","Clue19":"Now that we've given you facts and pleasure,\nWe will lead you to our Valley Quest treasure.\nGo north up the tracks looking to your left side\nIn a wall made of wood the treasure box will hide!","Clue14":"Go to the tracks and walk 46 ties back\nTo a wide wooden door beside the track.\nLuggage was loaded through that rolling door\nAnd steamer trunks piled up, ceiling to floor.\n","Special Features":"Natural","Clue3":"Before the railroad came to Fairlee,\nPeople didn't travel merrily:\nThey had to go by river raft\nOr stagecoach on a bumpy path.","Clue8":"It was the time of the Great Depression\nWhich taught our country a great big lesson.\nHobos rode the train from around the U.S.\nJoseph gave them food and a place to rest.\nThey'd go to the river following a path\nTo shanties that kept out the weather' wrath.","Season":"May-Oct ","Location":"Fairlee, VT","Clue16":"Now look for a pole that is tall, wooden and long.\nIt helped keep things from going wrong.\nIt use to be a semaphore,\nWhose signals prevented a lot of gore.","Clue11":"Now retrace your steps to the Depot's front door\nGo to its south wall - we'll show you some more.","Duration":"30","Walking Conditions":"Trail","Difficulty":"Easy","Clue2":"Welcome to the Fairlee Depot Quest!\nWe'll send you north, east & west.\nYou'll learn about railroad history\nWhile you seek our treasure-box mystery!","Description":"Walking through space to mars, you will see stars and martians. There is no comparing the greenness of the aliens, and their work on mars creates an awesome place to explore. Have fun going back in time and changing the past, or seeing the ultimite end of human life from a distance. It's all fun and games when it comes to the this marian trip. This is a fake description","Clue7":"Now walk to the tracks keeping the depot on your right\nAnd we'll point out a special site.\nStop at the corner and look to the east\nAnd you'll see where hobos could get a feast.\n","Clue18":"From the semaphore, go north 56 ties,\nThat's where what's known as the sidetrack lies.\nWhen two trains were coming, one would make the decision\nTo pull onto the sidetrack--and avoid a collision.","Clue13":"This is the floor the old creamery had\nBack when dairying in Vermont was really rad!\nThe creamery sent milk to other places--\nTo put white moustaches on people's faces!","Bring":"Binoculars","Clue1":"To get there: Take I-91 to the Fairlee exit (15).  At the bottom of the off ramp turn east, and then turn left at the T onto Route 5 north. The Quest begins at Ide's Feed Store, just south of the Depot in the heart of Fairlee. ","Clue6":"He was the master of this station\nAnd made it a wonderful destination.\nHe planted flowers and vegetables, too,\nDisplayed fool's gold & mica for travelers through. ","Clue15":"When campers arrived for Lakes Morey & Fairlee\nThe trunks all arrived about 10 days early.\nCamps' horses came, too, and went wild when they arrived\nAnd would tear down main street from the Depot's drive.","Clue10":"Follow the trees along towards the steeple\nAt the seventh tree, look west, please, people!\nOur stationmaster's house was number 1910.\nThe Depot was Fairlee's town center then."},"Quest40":{"Special Features":"Natural","Description":"Walking through space to mars, you will see stars and martians. There is no comparing the greenness of the aliens, and their work on mars creates an awesome place to explore. Have fun going back in time and changing the past, or seeing the ultimite end of human life from a distance. It's all fun and games when it comes to the this marian trip. This is a fake description","Walking Conditions":"Trail","Clue3":"Go to the bank\nand don't get spanked.\n\nGo to the upper edge \nof Flat Rock.\nDon't slip and take a dip.","Clue1":"To get there: From Rte. 10, take 25A for about 4 miles to Quintown Road. Take a right onto Quintown Road and go almost exactly one mile.  Parking is on the left.  The road widens out just a bit to allow for parking.","Season":"May-Oct ","Location":"Orford, NH","Bring":"Binoculars","Clue4":"Go to the culvert and\ntry not to take a slide ride.\n\nGo to the middle \nof Flat Rock, Doc.\n\nGo to the steps\nbut don't get wet.","Duration":"30","Clue2":"Start where you park.\n\nGo to the big boulder\nBeware it's colder.\n\nGo to the pool\nand you'll be cool.\n","Title":"Flat Rock Quest\nOrford, NH\n\nTo get there: From Rte. 10, take 25A for about 4 miles to Quintown Road. Take a right onto Quintown Road and go almost exactly one mile.  Parking is on the left.  The road widens out just a bit to allow for parking.","Difficulty":"Easy","Clue5":"Go to the steps\nbut don't get wet.\n\nGo back to the bank\nduck your shoulder\nso you don't hit the boulder.\nUnder those rocks\nyou'll find the box.\n"},"Quest94":{"Clue5":"Crossing the bridges and through the trees,\nThen to the logs if you please.\nUp the rise continuing on,\nAnd follow the trail up and beyond.","Title":"SCA QUEST","Clue12":"The mountains are gone now,\nSo on to the pines!\nDash down the stone wall from corner to pass,\nGo under the archway but not too fast!","Clue4":"Walk down the trail, with grass so high,\nLetting you still see a slice of sky.\nBut keep your eye to the right\nOr you might get lost far from sight.","Clue9":"Now keep walking ye wanderers must do,\nOn up the rise hoping the sky will stay blue.  \nThe journey is not yet done,\nFor there is still some more fun.","Clue14":"Come down through the circle,\nAnd back down the path.\nYou'll come to a stone wall,\nYou've reached it at last! ","Special Features":"Natural","Clue3":"Welcome to the SCA! \nLook around and you will see\nThe fire that may escape from thee.\nLook straight ahead, down through the trees,\nThere you can find the water that will please.","Clue8":"Across the field, a path there might be.\nWith sumac adjacent and vines to the right.\nThrough the tree line the field fades away,\nWith an image of trees hugging lays at bay.","Season":"May-Oct ","Location":"Charlestown, NH","Clue11":"You're almost there, patient you must be.\nFor the treasure is close, almost close enough to see.\nLook up at the mountains just over the pines,\nYou've come here for the treasure, so don't fall behind.","Duration":"30","Walking Conditions":"Trail","Clue2":"Turn right onto Route 12A south. Continue for 6-7 miles. Pass Merriam-Graves on your left, and then pull into the SCA parking lot on the right. ","Difficulty":"Easy","Description":"Walking through space to mars, you will see stars and martians. There is no comparing the greenness of the aliens, and their work on mars creates an awesome place to explore. Have fun going back in time and changing the past, or seeing the ultimite end of human life from a distance. It's all fun and games when it comes to the this marian trip. This is a fake description","Clue7":"Back up the hill your treasure awaits,\nThrough the opening making haste.\nYou come to a field now, so yield to your left.\nCrossing diagonally I think would be best.","Clue13":"So walk through the garden,\nOn down the path.\nNow stop at the signpost,\nFor the treasure you have passed.","Clue1":"To get there:  Take I-91 to Exit 8 (Claremont\/Ascutney). Follow Routes 11\/12\/131 East towards New Hampshire. Proceed through several lights, cross the bridge over the Connecticut River","Clue6":"A trail on your right, pass it by.\nAnd a tree with mushrooms you will spy.\nThrough twin trees and up the curve.\nDown the hill and left you will swerve.\n\nHere you can stay, both night and day,\nWhat a delight-this camp or picnic site.","Bring":"Binoculars","Clue10":"Follow the snake going on past the tree,\nThe one that will watch but never will sleep.\nWhere the bent oak leans o'er the great pine,\nGo up on the rise and start your decline."},"Quest16":{"Clue21":"Now can you find the Quest box?","Clue5":"It used to be called the Phelps Hotel.\nThe Phelps brothers bought it in 1865.  \nThey fixed it up with $4,500 worth of California gold.","Clue17":"Take another rest and think of \nSuccess. Look for the sign that has a tree name in it.\nSurrounded by maples and birches, \nFollow the path to where you can eat.\n{Gazebo Built in 1926}","Title":"Grafton Town - The Cave Quest","Clue12":" Now, to find your next clue, \n You need to get to the main entrance of the Village park.\n How you do that is up to you, but\nWe suggest that you find a friendly \nNative and ask for directions.","Clue4":"Face this building, turn left and continue up Main St.\nOn your left will be the biggest building in town.\nThis is The Old Tavern. It was built in 1801 \nand then doubled in size in 1820!","Clue9":" Soon you will see a place of prayer.\nThis brick church was built in 1833.\nIt used to have sheds behind it \nfor church goers to park their horses. ","Clue19":"Go around the huge rock. Look for the blue\nRibbon on a tree. Then get back on the trail.\nFollow the red blazes until you get to the steps.","Clue14":"Once you're at the main entrance, \nWalk about six steps and look out ahead \nAnd slightly to your right.\nYou should see a path.  ","Special Features":"Natural","Clue3":"Built in 1855, it was originally used for the town's post office. \nWrite down the first letter on the small rectangular sign\nWith phone numbers on it. ","Clue8":"Go through the ball field and past the bleachers and scoreboard.\nWhen you get to the split rail fence on your right, \nTake a right onto the path.\n(Make sure you follow rail fence near the rock wall)","Season":"May-Oct ","Location":"Grafton, VT","Clue16":"Passing by 1999 go to the place where you can read\nHave a seat and try to succeed\nThen on and not up to another room.","Clue20":"At last you have made it to the end \nOf the quest. Hope you had fun and\nReaped a lot of good.\nCheck out the entrance to this natural shelter in front of you.\nWhat shape and letter do you see?","Clue11":"There are only two church buildings in town.\nBoth churches united in 1920 and \nbecame The Church of Grafton.  \n","Duration":"30","Walking Conditions":"Trail","Difficulty":"Easy","Clue7":"The next stop on your quest is The Brick Church.\nTake Townsend road, which is off Main Street, on the left.\nWhen you get to the Daniels House, go right.","Description":"Walking through space to mars, you will see stars and martians. There is no comparing the greenness of the aliens, and their work on mars creates an awesome place to explore. Have fun going back in time and changing the past, or seeing the ultimite end of human life from a distance. It's all fun and games when it comes to the this marian trip. This is a fake description","Clue2":"Start your quest on Main Street.\nIt starts two houses west of the bridge \nGo to the building where people go to buy houses. ","Clue18":"You can sit at the table and cook up a meal. \nFor now for our town you will have a feel. \nHere our oldest fire pit rocks \nAre surrounded by beautiful hemlocks.","Clue13":"But if you are feeling shy\nCircle round the building counter clockwise.\nWhere bricks end and wood begins\nLook for two brick chimneys.\nProceed that-a-way and find the village park.","Bring":"Binoculars","Clue1":"To get there: Follow Rt. 121 to Grafton. The Quest begins near the \"Old Fire Barn\", just west of the bridge and near the intersection of Main St. (121) with Townsend Rd. (35).","Clue6":"Go inside to the desk and look up on the wall\nfor a famous civil war general's  name.","Clue15":"Take the path  for a while\n(This path could be covered with snow in winter)\nYou will see red markers soon.","Clue10":"People bought the stalls behind the church, \njust like they used to buy the pews inside it."},"Quest99":{"Clue5":"Our bridge is the boss\nThat you will soon cross\nIts continuous strength\nWill take you the length\nIt is a left that you will turn\nThe rest of the trail you'll earn.","Title":"Danville Town Forest Quest","Clue12":"But before you depart\nTo the box\nYou should start\nDon't get \"stumped\"\nLook behind one bench\nIt's there, and\nYour quest thirst will be quenched.","Clue4":"Near an old pine\nKeep going and you'll be fine.\nAfter the last cedar rail\nYou'll take about twenty-one steps and turn right\nThe four black cherries will be in sight.","Clue9":"When you reach the logging trail\nDon't go left or right\nCross it and head up the hill.\nAfter you've reached the top\nHow many switchbacks have you climbed?\nThe first one's not so bad\nThe second is the worst\nStop on the third and quench your thirst.","Special Features":"Natural","Clue3":"It's at this walkway\nWhere you begin\nStay between the parallel poles\nAnd they will lead you within.\nThough it's a road\nIt's really our trail\nAt the first bend there's an apple tree","Clue8":"As you walk along enjoying the serenity\nStop to take a look above triangle tree\nYou will hear the sound of the burbling brook\nBarbed wire, at the stone wall you take a look.\nThe skylight above will light your way\nEven if it's a cloudy day.\nAt the end of our section notice the mushroom shelves\nMaybe if you're quick you'll see some elves.","Season":"May-Oct ","Location":"Danville, VT","Clue11":"Nearing a fork\nStay to the left\nTake a deep breath \nIt's almost time to rest.\nYou're at the top\nYou're climbing's been completed\nThe fun's not over\nMore hiking is needed.","Duration":"30","Walking Conditions":"Trail","Clue2":"Turn left on Access Road-look for the \"Town Forest\" sign.  Travel 0.2 mi. on the single lane, dirt Access Rd. to the clearing.  Park in the lot there. The Quest begins at the brochure box.","Difficulty":"Easy","Description":"Walking through space to mars, you will see stars and martians. There is no comparing the greenness of the aliens, and their work on mars creates an awesome place to explore. Have fun going back in time and changing the past, or seeing the ultimite end of human life from a distance. It's all fun and games when it comes to the this marian trip. This is a fake description","Clue7":"Welcome to the next section\nDon't fall down the ridge\nFor soon you'll be crossing \nour primitive bridge\nBeeches\nBirches\nBugs \nAnd Brooks\nThey're the essence of our trail's look.","Clue13":"Descending the hill will be a test\nThe first step should be to the west\nFollow the trail\nAccording to the wood\nAt the end of the maple grove\nLook ahead to the arrow\nFor ahead the trail should get less narrow\nYou're on your way down the logging road \nBack to cars and headed for home.","Clue1":"To Get There:  From the blinking light in Danville, take Route 2 east for 1.1 miles.  Turn right on Penny Lane and travel 2.8 miles.  ","Clue6":"Along the road\nThen left to woods\nLike in a dream\nYou'll follow our stream\nAlas from our sylvan dream\nYou must leave\nJust before you go\nTake pause and deeply breathe.","Bring":"Binoculars","Clue10":"You're getting closer to the top\nAnd just before you do\nNotice all the hemlock stumps\nOn either side of you.\nExit our woods into a clearing\nAt the stump,\nLeft,\nYou'll be steering."},"Quest104":{"Clue21":"See?  Now you've come back to the flat place,\nWhere canoes and potties you should face.\nBack in your vessel, or explore some more . . .\nWe hope this island Quest wasn't a bore!","Clue5":"You will also know that you are getting quite near\nIf a free-standing potty of blue does appear.\nAround the bend now, keep to the right,\n'Til a tiny island of birch is in sight.","Clue17":"'Round a bend, up a hill, keep walking to find\nA green-painted table of the picnicky kind.\nIt should be sitting quite close to a circle of stone,\nYou have now arrived in the Quest box zone!","Title":"Gilman Island Quest","Clue12":"Now Ledyard had cabins on these islands three,\nBut when the water got high they could no longer be.\nSo the club rented land from New England Power\nOn this island, called \"Gilman,\" that used to be \"Nicker.\"","Clue4":"At the tip of this isle, take a left toward the tree\nThat hangs out o'er the water for all to come see.\nUp ahead, to your right, a spot you should spy,\nWhere the land is as flat as a big pizza pie.","Clue9":"If you follow the orange, you'll come to a cabin,\nBuilt in honor of a past Marine Corps captain.\nT'was John Abbot Titcomb, class of 1932,\nKilled fighting bravely during World War II.","Clue19":"The logs are all rotting, just lying around, \nBut look to the stump that still stands in the ground.\nAt the stump's base, please carefully seek-\nOut from a birch \"sleeve\" the box should peek.","Clue14":"Behind the cabin, there's a rock with a blaze,\nSo carefully climb to the top to continue this maze.\nYou'll observe that the trail has changed just a bit.\nThe land is more rugged; make sure you don't trip!","Special Features":"Natural","Clue3":"Past the bridge, you should keep going straight,\nTo the right is an arch; many divers can relate.\nFurther on to your left you should see a sewage place,\nSo just row a bit more and this island you'll face.","Clue8":"Meander along-keep the shore on your right\n(A wander off-trail might cause a fright).\nThe blazes are there, just keep following them 'round,\nBut do be careful of rocks and stumps on the ground.","Season":"May-Oct ","Location":"Hanover, NH","Clue16":"When you reach a fire pit, the trails splits here,\nSo keep to the LEFT for your treasure so dear.\nContinue along, seeking orange tree paint,\nIf the water is still to your right, then you are a saint.","Clue20":"Sign in, collect the stamp, and place it carefully back\nFor other clever Questers who are on the right track.\nTo get back to your boat, get back on the trail,\nAnd keep following the blazes 'round-you won't fail.","Clue11":"The water upstream was raised 15 feet,\nSubmerging three islands whole-what a feat!\nChase, Occum, and Johnny Johnson were their names,\nNow these islands exist only in fame.","Duration":"30","Walking Conditions":"Trail","Difficulty":"Easy","Clue7":"Now climb from your vessel and head into the woods,\nYou'll want to head RIGHT for your treasure box goods.\nNow look to the trees where you'll see orange marks,\nOn or replacing what once was their bark.","Description":"Walking through space to mars, you will see stars and martians. There is no comparing the greenness of the aliens, and their work on mars creates an awesome place to explore. Have fun going back in time and changing the past, or seeing the ultimite end of human life from a distance. It's all fun and games when it comes to the this marian trip. This is a fake description","Clue2":"Head from the docks and the house for canoes,\nPaddle toward the bridge upon this water so blue.\nThis river and valley are older than you know,\nFormed by a glacial lake oh so many years ago.","Clue18":"Sit at the table with your back to the fire,\nLook straight ahead-a dead birch you desire.\nThe water should be to your right and behind, \nNow 25 paces 'til the dead birch you find.","Clue13":"Since Ledyard Canoe Club had cabins no longer,\nThis one you see here was built to be stronger\n(and higher above that dam's water line\nthat swallowed up those others so fine).","Bring":"Binoculars","Clue1":"To Get There:  This Quest begins at the Ledyard Canoe Club (LCC).  LCC is located at the north end of the parking lot on the east (Hanover) side of the Ledyard Bridge.  Please note: You will need a canoe or kayak to complete this Quest!  They can be rented at the LCC.","Clue6":"At this point in your paddle, you have come to a beach\nWhere a \"Canoe Rest AreaóNew England Power\" sign is in reach.\n\"Park\" your canoe on the sand, and tie it up tight,\nOr you will be swimming back home tonight.","Clue15":"Along the isle's ridge, like an explorer you walk,\nKeep marching along, keep an eye on the clock.\nThis may take a while, be patient my friend,\nAnd remember to enjoy this Quest 'til the end.","Clue10":"This lovely log cabin was built in '52,\nBut WHY? Give a listen and I'll tell you...\nThe Wilder Dam is found just downstream,\nWhen it was built it caused quite a scene."}}